arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
/* ADC12CTL1 Control Bits */
#define ADC12BUSY           (0x0001u)    /* ADC12 Busy */
#define ADC12CONSEQ0        (0x0002u)    /* ADC12 Conversion Sequence Select Bit: 0 */
#define ADC12CONSEQ1        (0x0004u)    /* ADC12 Conversion Sequence Select Bit: 1 */
#define ADC12SSEL0          (0x0008u)    /* ADC12 Clock Source Select Bit: 0 */
#define ADC12SSEL1          (0x0010u)    /* ADC12 Clock Source Select Bit: 1 */
#define ADC12DIV0           (0x0020u)    /* ADC12 Clock Divider Select Bit: 0 */
#define ADC12DIV1           (0x0040u)    /* ADC12 Clock Divider Select Bit: 1 */
#define ADC12DIV2           (0x0080u)    /* ADC12 Clock Divider Select Bit: 2 */
#define ADC12ISSH           (0x0100u)    /* ADC12 Invert Sample Hold Signal */
#define ADC12SHP            (0x0200u)    /* ADC12 Sample/Hold Pulse Mode */
#define ADC12SHS0           (0x0400u)    /* ADC12 Sample/Hold Source Bit: 0 */
#define ADC12SHS1           (0x0800u)    /* ADC12 Sample/Hold Source Bit: 1 */
#define ADC12SHS2           (0x1000u)    /* ADC12 Sample/Hold Source Bit: 2 */
#define ADC12PDIV0          (0x2000u)    /* ADC12 Predivider Bit: 0 */
#define ADC12PDIV1          (0x4000u)    /* ADC12 Predivider Bit: 1 */

/* ADC12CTL1 Control Bits */
#define ADC12BUSY_L         (0x0001u)    /* ADC12 Busy */
#define ADC12CONSEQ0_L      (0x0002u)    /* ADC12 Conversion Sequence Select Bit: 0 */
#define ADC12CONSEQ1_L      (0x0004u)    /* ADC12 Conversion Sequence Select Bit: 1 */
#define ADC12SSEL0_L        (0x0008u)    /* ADC12 Clock Source Select Bit: 0 */
#define ADC12SSEL1_L        (0x0010u)    /* ADC12 Clock Source Select Bit: 1 */
#define ADC12DIV0_L         (0x0020u)    /* ADC12 Clock Divider Select Bit: 0 */
#define ADC12DIV1_L         (0x0040u)    /* ADC12 Clock Divider Select Bit: 1 */
#define ADC12DIV2_L         (0x0080u)    /* ADC12 Clock Divider Select Bit: 2 */

/* ADC12CTL1 Control Bits */
#define ADC12ISSH_H         (0x0001u)    /* ADC12 Invert Sample Hold Signal */
#define ADC12SHP_H          (0x0002u)    /* ADC12 Sample/Hold Pulse Mode */
#define ADC12SHS0_H         (0x0004u)    /* ADC12 Sample/Hold Source Bit: 0 */
#define ADC12SHS1_H         (0x0008u)    /* ADC12 Sample/Hold Source Bit: 1 */
#define ADC12SHS2_H         (0x0010u)    /* ADC12 Sample/Hold Source Bit: 2 */
#define ADC12PDIV0_H        (0x0020u)    /* ADC12 Predivider Bit: 0 */
#define ADC12PDIV1_H        (0x0040u)    /* ADC12 Predivider Bit: 1 */

#define ADC12CONSEQ_0        (0*0x0002u) /* ADC12 Conversion Sequence Select: 0 */
#define ADC12CONSEQ_1        (1*0x0002u) /* ADC12 Conversion Sequence Select: 1 */
#define ADC12CONSEQ_2        (2*0x0002u) /* ADC12 Conversion Sequence Select: 2 */
#define ADC12CONSEQ_3        (3*0x0002u) /* ADC12 Conversion Sequence Select: 3 */

#define ADC12SSEL_0          (0*0x0008u) /* ADC12 Clock Source Select: 0 */
#define ADC12SSEL_1          (1*0x0008u) /* ADC12 Clock Source Select: 1 */
#define ADC12SSEL_2          (2*0x0008u) /* ADC12 Clock Source Select: 2 */
#define ADC12SSEL_3          (3*0x0008u) /* ADC12 Clock Source Select: 3 */

#define ADC12DIV_0           (0*0x0020u) /* ADC12 Clock Divider Select: 0 */
#define ADC12DIV_1           (1*0x0020u) /* ADC12 Clock Divider Select: 1 */
#define ADC12DIV_2           (2*0x0020u) /* ADC12 Clock Divider Select: 2 */
#define ADC12DIV_3           (3*0x0020u) /* ADC12 Clock Divider Select: 3 */
#define ADC12DIV_4           (4*0x0020u) /* ADC12 Clock Divider Select: 4 */
#define ADC12DIV_5           (5*0x0020u) /* ADC12 Clock Divider Select: 5 */
#define ADC12DIV_6           (6*0x0020u) /* ADC12 Clock Divider Select: 6 */
#define ADC12DIV_7           (7*0x0020u) /* ADC12 Clock Divider Select: 7 */

#define ADC12SHS_0           (0*0x0400u) /* ADC12 Sample/Hold Source: 0 */
#define ADC12SHS_1           (1*0x0400u) /* ADC12 Sample/Hold Source: 1 */
#define ADC12SHS_2           (2*0x0400u) /* ADC12 Sample/Hold Source: 2 */
#define ADC12SHS_3           (3*0x0400u) /* ADC12 Sample/Hold Source: 3 */
#define ADC12SHS_4           (4*0x0400u) /* ADC12 Sample/Hold Source: 4 */
#define ADC12SHS_5           (5*0x0400u) /* ADC12 Sample/Hold Source: 5 */
#define ADC12SHS_6           (6*0x0400u) /* ADC12 Sample/Hold Source: 6 */
#define ADC12SHS_7           (7*0x0400u) /* ADC12 Sample/Hold Source: 7 */

#define ADC12PDIV_0          (0*0x2000u) /* ADC12 Clock predivider Select 0 */
#define ADC12PDIV_1          (1*0x2000u) /* ADC12 Clock predivider Select 1 */
#define ADC12PDIV_2          (2*0x2000u) /* ADC12 Clock predivider Select 2 */
#define ADC12PDIV_3          (3*0x2000u) /* ADC12 Clock predivider Select 3 */
#define ADC12PDIV__1         (0*0x2000u) /* ADC12 Clock predivider Select: /1 */
#define ADC12PDIV__4         (1*0x2000u) /* ADC12 Clock predivider Select: /4 */
#define ADC12PDIV__32        (2*0x2000u) /* ADC12 Clock predivider Select: /32 */
#define ADC12PDIV__64        (3*0x2000u) /* ADC12 Clock predivider Select: /64 */

/* ADC12CTL2 Control Bits */
#define ADC12PWRMD          (0x0001u)    /* ADC12 Power Mode */
#define ADC12DF             (0x0008u)    /* ADC12 Data Format */
#define ADC12RES0           (0x0010u)    /* ADC12 Resolution Bit: 0 */
#define ADC12RES1           (0x0020u)    /* ADC12 Resolution Bit: 1 */

/* ADC12CTL2 Control Bits */
#define ADC12PWRMD_L        (0x0001u)    /* ADC12 Power Mode */
#define ADC12DF_L           (0x0008u)    /* ADC12 Data Format */
#define ADC12RES0_L         (0x0010u)    /* ADC12 Resolution Bit: 0 */
#define ADC12RES1_L         (0x0020u)    /* ADC12 Resolution Bit: 1 */

#define ADC12RES_0          (0x0000u)    /* ADC12+ Resolution : 8 Bit */
#define ADC12RES_1          (0x0010u)    /* ADC12+ Resolution : 10 Bit */
#define ADC12RES_2          (0x0020u)    /* ADC12+ Resolution : 12 Bit */
#define ADC12RES_3          (0x0030u)    /* ADC12+ Resolution : reserved */

#define ADC12RES__8BIT      (0x0000u)    /* ADC12+ Resolution : 8 Bit */
#define ADC12RES__10BIT     (0x0010u)    /* ADC12+ Resolution : 10 Bit */
#define ADC12RES__12BIT     (0x0020u)    /* ADC12+ Resolution : 12 Bit */

/* ADC12CTL3 Control Bits */
#define ADC12CSTARTADD0     (0x0001u)    /* ADC12 Conversion Start Address Bit: 0 */
#define ADC12CSTARTADD1     (0x0002u)    /* ADC12 Conversion Start Address Bit: 1 */
#define ADC12CSTARTADD2     (0x0004u)    /* ADC12 Conversion Start Address Bit: 2 */
#define ADC12CSTARTADD3     (0x0008u)    /* ADC12 Conversion Start Address Bit: 3 */
#define ADC12CSTARTADD4     (0x0010u)    /* ADC12 Conversion Start Address Bit: 4 */
#define ADC12BATMAP         (0x0040u)    /* ADC12 Internal AVCC/2 select */
#define ADC12TCMAP          (0x0080u)    /* ADC12 Internal TempSensor select */
#define ADC12ICH0MAP        (0x0100u)    /* ADC12 Internal Channel 0 select */
#define ADC12ICH1MAP        (0x0200u)    /* ADC12 Internal Channel 1 select */
#define ADC12ICH2MAP        (0x0400u)    /* ADC12 Internal Channel 2 select */
#define ADC12ICH3MAP        (0x0800u)    /* ADC12 Internal Channel 3 select */

/* ADC12CTL3 Control Bits */
#define ADC12CSTARTADD0_L   (0x0001u)    /* ADC12 Conversion Start Address Bit: 0 */
#define ADC12CSTARTADD1_L   (0x0002u)    /* ADC12 Conversion Start Address Bit: 1 */
#define ADC12CSTARTADD2_L   (0x0004u)    /* ADC12 Conversion Start Address Bit: 2 */
#define ADC12CSTARTADD3_L   (0x0008u)    /* ADC12 Conversion Start Address Bit: 3 */
#define ADC12CSTARTADD4_L   (0x0010u)    /* ADC12 Conversion Start Address Bit: 4 */
#define ADC12BATMAP_L       (0x0040u)    /* ADC12 Internal AVCC/2 select */
#define ADC12TCMAP_L        (0x0080u)    /* ADC12 Internal TempSensor select */

/* ADC12CTL3 Control Bits */
#define ADC12ICH0MAP_H      (0x0001u)    /* ADC12 Internal Channel 0 select */
#define ADC12ICH1MAP_H      (0x0002u)    /* ADC12 Internal Channel 1 select */
#define ADC12ICH2MAP_H      (0x0004u)    /* ADC12 Internal Channel 2 select */
#define ADC12ICH3MAP_H      (0x0008u)    /* ADC12 Internal Channel 3 select */

#define ADC12CSTARTADD_0     ( 0*0x0001u) /* ADC12 Conversion Start Address: 0 */
#define ADC12CSTARTADD_1     ( 1*0x0001u) /* ADC12 Conversion Start Address: 1 */
#define ADC12CSTARTADD_2     ( 2*0x0001u) /* ADC12 Conversion Start Address: 2 */
#define ADC12CSTARTADD_3     ( 3*0x0001u) /* ADC12 Conversion Start Address: 3 */
#define ADC12CSTARTADD_4     ( 4*0x0001u) /* ADC12 Conversion Start Address: 4 */
#define ADC12CSTARTADD_5     ( 5*0x0001u) /* ADC12 Conversion Start Address: 5 */
#define ADC12CSTARTADD_6     ( 6*0x0001u) /* ADC12 Conversion Start Address: 6 */
#define ADC12CSTARTADD_7     ( 7*0x0001u) /* ADC12 Conversion Start Address: 7 */
#define ADC12CSTARTADD_8     ( 8*0x0001u) /* ADC12 Conversion Start Address: 8 */
#define ADC12CSTARTADD_9     ( 9*0x0001u) /* ADC12 Conversion Start Address: 9 */
#define ADC12CSTARTADD_10    (10*0x0001u) /* ADC12 Conversion Start Address: 10 */
#define ADC12CSTARTADD_11    (11*0x0001u) /* ADC12 Conversion Start Address: 11 */
#define ADC12CSTARTADD_12    (12*0x0001u) /* ADC12 Conversion Start Address: 12 */
#define ADC12CSTARTADD_13    (13*0x0001u) /* ADC12 Conversion Start Address: 13 */
#define ADC12CSTARTADD_14    (14*0x0001u) /* ADC12 Conversion Start Address: 14 */
#define ADC12CSTARTADD_15    (15*0x0001u) /* ADC12 Conversion Start Address: 15 */
#define ADC12CSTARTADD_16    (16*0x0001u) /* ADC12 Conversion Start Address: 16 */
#define ADC12CSTARTADD_17    (17*0x0001u) /* ADC12 Conversion Start Address: 17 */
#define ADC12CSTARTADD_18    (18*0x0001u) /* ADC12 Conversion Start Address: 18 */
#define ADC12CSTARTADD_19    (19*0x0001u) /* ADC12 Conversion Start Address: 19 */
#define ADC12CSTARTADD_20    (20*0x0001u) /* ADC12 Conversion Start Address: 20 */
#define ADC12CSTARTADD_21    (21*0x0001u) /* ADC12 Conversion Start Address: 21 */
#define ADC12CSTARTADD_22    (22*0x0001u) /* ADC12 Conversion Start Address: 22 */
#define ADC12CSTARTADD_23    (23*0x0001u) /* ADC12 Conversion Start Address: 23 */
#define ADC12CSTARTADD_24    (24*0x0001u) /* ADC12 Conversion Start Address: 24 */
#define ADC12CSTARTADD_25    (25*0x0001u) /* ADC12 Conversion Start Address: 25 */
#define ADC12CSTARTADD_26    (26*0x0001u) /* ADC12 Conversion Start Address: 26 */
#define ADC12CSTARTADD_27    (27*0x0001u) /* ADC12 Conversion Start Address: 27 */
#define ADC12CSTARTADD_28    (28*0x0001u) /* ADC12 Conversion Start Address: 28 */
#define ADC12CSTARTADD_29    (29*0x0001u) /* ADC12 Conversion Start Address: 29 */
#define ADC12CSTARTADD_30    (30*0x0001u) /* ADC12 Conversion Start Address: 30 */
#define ADC12CSTARTADD_31    (31*0x0001u) /* ADC12 Conversion Start Address: 31 */

/* ADC12MCTLx Control Bits */
#define ADC12INCH0          (0x0001u)    /* ADC12 Input Channel Select Bit 0 */
#define ADC12INCH1          (0x0002u)    /* ADC12 Input Channel Select Bit 1 */
#define ADC12INCH2          (0x0004u)    /* ADC12 Input Channel Select Bit 2 */
#define ADC12INCH3          (0x0008u)    /* ADC12 Input Channel Select Bit 3 */
#define ADC12INCH4          (0x0010u)    /* ADC12 Input Channel Select Bit 4 */
#define ADC12EOS            (0x0080u)    /* ADC12 End of Sequence */
#define ADC12VRSEL0         (0x0100u)    /* ADC12 VR Select Bit 0 */
#define ADC12VRSEL1         (0x0200u)    /* ADC12 VR Select Bit 1 */
#define ADC12VRSEL2         (0x0400u)    /* ADC12 VR Select Bit 2 */
#define ADC12VRSEL3         (0x0800u)    /* ADC12 VR Select Bit 3 */
#define ADC12DIF            (0x2000u)    /* ADC12 Differential mode (only for even Registers) */
#define ADC12WINC           (0x4000u)    /* ADC12 Comparator window enable */

/* ADC12MCTLx Control Bits */
#define ADC12INCH0_L        (0x0001u)    /* ADC12 Input Channel Select Bit 0 */
#define ADC12INCH1_L        (0x0002u)    /* ADC12 Input Channel Select Bit 1 */
#define ADC12INCH2_L        (0x0004u)    /* ADC12 Input Channel Select Bit 2 */
#define ADC12INCH3_L        (0x0008u)    /* ADC12 Input Channel Select Bit 3 */
#define ADC12INCH4_L        (0x0010u)    /* ADC12 Input Channel Select Bit 4 */
#define ADC12EOS_L          (0x0080u)    /* ADC12 End of Sequence */

/* ADC12MCTLx Control Bits */
#define ADC12VRSEL0_H       (0x0001u)    /* ADC12 VR Select Bit 0 */
#define ADC12VRSEL1_H       (0x0002u)    /* ADC12 VR Select Bit 1 */
#define ADC12VRSEL2_H       (0x0004u)    /* ADC12 VR Select Bit 2 */
#define ADC12VRSEL3_H       (0x0008u)    /* ADC12 VR Select Bit 3 */
#define ADC12DIF_H          (0x0020u)    /* ADC12 Differential mode (only for even Registers) */
#define ADC12WINC_H         (0x0040u)    /* ADC12 Comparator window enable */

#define ADC12INCH_0         (0x0000u)    /* ADC12 Input Channel 0 */
#define ADC12INCH_1         (0x0001u)    /* ADC12 Input Channel 1 */
#define ADC12INCH_2         (0x0002u)    /* ADC12 Input Channel 2 */
#define ADC12INCH_3         (0x0003u)    /* ADC12 Input Channel 3 */
#define ADC12INCH_4         (0x0004u)    /* ADC12 Input Channel 4 */
#define ADC12INCH_5         (0x0005u)    /* ADC12 Input Channel 5 */
#define ADC12INCH_6         (0x0006u)    /* ADC12 Input Channel 6 */
#define ADC12INCH_7         (0x0007u)    /* ADC12 Input Channel 7 */
#define ADC12INCH_8         (0x0008u)    /* ADC12 Input Channel 8 */
#define ADC12INCH_9         (0x0009u)    /* ADC12 Input Channel 9 */
#define ADC12INCH_10        (0x000Au)    /* ADC12 Input Channel 10 */
#define ADC12INCH_11        (0x000Bu)    /* ADC12 Input Channel 11 */
#define ADC12INCH_12        (0x000Cu)    /* ADC12 Input Channel 12 */
#define ADC12INCH_13        (0x000Du)    /* ADC12 Input Channel 13 */
#define ADC12INCH_14        (0x000Eu)    /* ADC12 Input Channel 14 */
#define ADC12INCH_15        (0x000Fu)    /* ADC12 Input Channel 15 */
#define ADC12INCH_16        (0x0010u)    /* ADC12 Input Channel 16 */
#define ADC12INCH_17        (0x0011u)    /* ADC12 Input Channel 17 */
#define ADC12INCH_18        (0x0012u)    /* ADC12 Input Channel 18 */
#define ADC12INCH_19        (0x0013u)    /* ADC12 Input Channel 19 */
#define ADC12INCH_20        (0x0014u)    /* ADC12 Input Channel 20 */
#define ADC12INCH_21        (0x0015u)    /* ADC12 Input Channel 21 */
#define ADC12INCH_22        (0x0016u)    /* ADC12 Input Channel 22 */
#define ADC12INCH_23        (0x0017u)    /* ADC12 Input Channel 23 */
#define ADC12INCH_24        (0x0018u)    /* ADC12 Input Channel 24 */
#define ADC12INCH_25        (0x0019u)    /* ADC12 Input Channel 25 */
#define ADC12INCH_26        (0x001Au)    /* ADC12 Input Channel 26 */
#define ADC12INCH_27        (0x001Bu)    /* ADC12 Input Channel 27 */
#define ADC12INCH_28        (0x001Cu)    /* ADC12 Input Channel 28 */
#define ADC12INCH_29        (0x001Du)    /* ADC12 Input Channel 29 */
#define ADC12INCH_30        (0x001Eu)    /* ADC12 Input Channel 30 */
#define ADC12INCH_31        (0x001Fu)    /* ADC12 Input Channel 31 */

#define ADC12VRSEL_0        (0*0x100u)    /* ADC12 Select Reference 0 */
#define ADC12VRSEL_1        (1*0x100u)    /* ADC12 Select Reference 1 */
#define ADC12VRSEL_2        (2*0x100u)    /* ADC12 Select Reference 2 */
#define ADC12VRSEL_3        (3*0x100u)    /* ADC12 Select Reference 3 */
#define ADC12VRSEL_4        (4*0x100u)    /* ADC12 Select Reference 4 */
#define ADC12VRSEL_5        (5*0x100u)    /* ADC12 Select Reference 5 */
#define ADC12VRSEL_6        (6*0x100u)    /* ADC12 Select Reference 6 */
#define ADC12VRSEL_7        (7*0x100u)    /* ADC12 Select Reference 7 */
#define ADC12VRSEL_8        (8*0x100u)    /* ADC12 Select Reference 8  */
#define ADC12VRSEL_9        (9*0x100u)    /* ADC12 Select Reference 9  */
#define ADC12VRSEL_10       (10*0x100u)   /* ADC12 Select Reference 10 */
#define ADC12VRSEL_11       (11*0x100u)   /* ADC12 Select Reference 11 */
#define ADC12VRSEL_12       (12*0x100u)   /* ADC12 Select Reference 12 */
#define ADC12VRSEL_13       (13*0x100u)   /* ADC12 Select Reference 13 */
#define ADC12VRSEL_14       (14*0x100u)   /* ADC12 Select Reference 14 */
#define ADC12VRSEL_15       (15*0x100u)   /* ADC12 Select Reference 15 */

/* ADC12HI Control Bits */

