arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
/* ADC12LO Control Bits */

/* ADC12IER0 Control Bits */
#define ADC12IE0          (0x0001u)  /* ADC12 Memory 0 Interrupt Enable */
#define ADC12IE1          (0x0002u)  /* ADC12 Memory 1 Interrupt Enable */
#define ADC12IE2          (0x0004u)  /* ADC12 Memory 2 Interrupt Enable */
#define ADC12IE3          (0x0008u)  /* ADC12 Memory 3 Interrupt Enable */
#define ADC12IE4          (0x0010u)  /* ADC12 Memory 4 Interrupt Enable */
#define ADC12IE5          (0x0020u)  /* ADC12 Memory 5 Interrupt Enable */
#define ADC12IE6          (0x0040u)  /* ADC12 Memory 6 Interrupt Enable */
#define ADC12IE7          (0x0080u)  /* ADC12 Memory 7 Interrupt Enable */
#define ADC12IE8          (0x0100u)  /* ADC12 Memory 8 Interrupt Enable */
#define ADC12IE9          (0x0200u)  /* ADC12 Memory 9 Interrupt Enable */
#define ADC12IE10          (0x0400u)  /* ADC12 Memory 10 Interrupt Enable */
#define ADC12IE11          (0x0800u)  /* ADC12 Memory 11 Interrupt Enable */
#define ADC12IE12          (0x1000u)  /* ADC12 Memory 12 Interrupt Enable */
#define ADC12IE13          (0x2000u)  /* ADC12 Memory 13 Interrupt Enable */
#define ADC12IE14          (0x4000u)  /* ADC12 Memory 14 Interrupt Enable */
#define ADC12IE15          (0x8000u)  /* ADC12 Memory 15 Interrupt Enable */

/* ADC12IER0 Control Bits */
#define ADC12IE0_L          (0x0001u)  /* ADC12 Memory 0 Interrupt Enable */
#define ADC12IE1_L          (0x0002u)  /* ADC12 Memory 1 Interrupt Enable */
#define ADC12IE2_L          (0x0004u)  /* ADC12 Memory 2 Interrupt Enable */
#define ADC12IE3_L          (0x0008u)  /* ADC12 Memory 3 Interrupt Enable */
#define ADC12IE4_L          (0x0010u)  /* ADC12 Memory 4 Interrupt Enable */
#define ADC12IE5_L          (0x0020u)  /* ADC12 Memory 5 Interrupt Enable */
#define ADC12IE6_L          (0x0040u)  /* ADC12 Memory 6 Interrupt Enable */
#define ADC12IE7_L          (0x0080u)  /* ADC12 Memory 7 Interrupt Enable */

/* ADC12IER0 Control Bits */
#define ADC12IE8_H          (0x0001u)  /* ADC12 Memory 8 Interrupt Enable */
#define ADC12IE9_H          (0x0002u)  /* ADC12 Memory 9 Interrupt Enable */
#define ADC12IE10_H         (0x0004u)  /* ADC12 Memory 10 Interrupt Enable */
#define ADC12IE11_H         (0x0008u)  /* ADC12 Memory 11 Interrupt Enable */
#define ADC12IE12_H         (0x0010u)  /* ADC12 Memory 12 Interrupt Enable */
#define ADC12IE13_H         (0x0020u)  /* ADC12 Memory 13 Interrupt Enable */
#define ADC12IE14_H         (0x0040u)  /* ADC12 Memory 14 Interrupt Enable */
#define ADC12IE15_H         (0x0080u)  /* ADC12 Memory 15 Interrupt Enable */

/* ADC12IER1 Control Bits */
#define ADC12IE16          (0x0001u)  /* ADC12 Memory 16 Interrupt Enable */
#define ADC12IE17          (0x0002u)  /* ADC12 Memory 17 Interrupt Enable */
#define ADC12IE18          (0x0004u)  /* ADC12 Memory 18 Interrupt Enable */
#define ADC12IE19          (0x0008u)  /* ADC12 Memory 19 Interrupt Enable */
#define ADC12IE20          (0x0010u)  /* ADC12 Memory 20 Interrupt Enable */
#define ADC12IE21          (0x0020u)  /* ADC12 Memory 21 Interrupt Enable */
#define ADC12IE22          (0x0040u)  /* ADC12 Memory 22 Interrupt Enable */
#define ADC12IE23          (0x0080u)  /* ADC12 Memory 23 Interrupt Enable */
#define ADC12IE24          (0x0100u)  /* ADC12 Memory 24 Interrupt Enable */
#define ADC12IE25          (0x0200u)  /* ADC12 Memory 25 Interrupt Enable */
#define ADC12IE26          (0x0400u)  /* ADC12 Memory 26 Interrupt Enable */
#define ADC12IE27          (0x0800u)  /* ADC12 Memory 27 Interrupt Enable */
#define ADC12IE28          (0x1000u)  /* ADC12 Memory 28 Interrupt Enable */
#define ADC12IE29          (0x2000u)  /* ADC12 Memory 29 Interrupt Enable */
#define ADC12IE30          (0x4000u)  /* ADC12 Memory 30 Interrupt Enable */
#define ADC12IE31          (0x8000u)  /* ADC12 Memory 31 Interrupt Enable */

/* ADC12IER1 Control Bits */
#define ADC12IE16_L         (0x0001u)  /* ADC12 Memory 16 Interrupt Enable */
#define ADC12IE17_L         (0x0002u)  /* ADC12 Memory 17 Interrupt Enable */
#define ADC12IE18_L         (0x0004u)  /* ADC12 Memory 18 Interrupt Enable */
#define ADC12IE19_L         (0x0008u)  /* ADC12 Memory 19 Interrupt Enable */
#define ADC12IE20_L         (0x0010u)  /* ADC12 Memory 20 Interrupt Enable */
#define ADC12IE21_L         (0x0020u)  /* ADC12 Memory 21 Interrupt Enable */
#define ADC12IE22_L         (0x0040u)  /* ADC12 Memory 22 Interrupt Enable */
#define ADC12IE23_L         (0x0080u)  /* ADC12 Memory 23 Interrupt Enable */

/* ADC12IER1 Control Bits */
#define ADC12IE24_H         (0x0001u)  /* ADC12 Memory 24 Interrupt Enable */
#define ADC12IE25_H         (0x0002u)  /* ADC12 Memory 25 Interrupt Enable */
#define ADC12IE26_H         (0x0004u)  /* ADC12 Memory 26 Interrupt Enable */
#define ADC12IE27_H         (0x0008u)  /* ADC12 Memory 27 Interrupt Enable */
#define ADC12IE28_H         (0x0010u)  /* ADC12 Memory 28 Interrupt Enable */
#define ADC12IE29_H         (0x0020u)  /* ADC12 Memory 29 Interrupt Enable */
#define ADC12IE30_H         (0x0040u)  /* ADC12 Memory 30 Interrupt Enable */
#define ADC12IE31_H         (0x0080u)  /* ADC12 Memory 31 Interrupt Enable */

/* ADC12IER2 Control Bits */
#define ADC12INIE           (0x0002u)    /* ADC12 Interrupt enable for the inside of window of the Window comparator */
#define ADC12LOIE           (0x0004u)    /* ADC12 Interrupt enable for lower threshold of the Window comparator */
#define ADC12HIIE           (0x0008u)    /* ADC12 Interrupt enable for upper threshold of the Window comparator */
#define ADC12OVIE           (0x0010u)    /* ADC12 ADC12MEMx Overflow interrupt enable */
#define ADC12TOVIE          (0x0020u)    /* ADC12 Timer Overflow interrupt enable */
#define ADC12RDYIE          (0x0040u)    /* ADC12 local buffered reference ready interrupt enable */

/* ADC12IER2 Control Bits */
#define ADC12INIE_L         (0x0002u)    /* ADC12 Interrupt enable for the inside of window of the Window comparator */
#define ADC12LOIE_L         (0x0004u)    /* ADC12 Interrupt enable for lower threshold of the Window comparator */
#define ADC12HIIE_L         (0x0008u)    /* ADC12 Interrupt enable for upper threshold of the Window comparator */
#define ADC12OVIE_L         (0x0010u)    /* ADC12 ADC12MEMx Overflow interrupt enable */
#define ADC12TOVIE_L        (0x0020u)    /* ADC12 Timer Overflow interrupt enable */
#define ADC12RDYIE_L        (0x0040u)    /* ADC12 local buffered reference ready interrupt enable */

/* ADC12IFGR0 Control Bits */
#define ADC12IFG0          (0x0001u)  /* ADC12 Memory 0 Interrupt Flag */
#define ADC12IFG1          (0x0002u)  /* ADC12 Memory 1 Interrupt Flag */
#define ADC12IFG2          (0x0004u)  /* ADC12 Memory 2 Interrupt Flag */
#define ADC12IFG3          (0x0008u)  /* ADC12 Memory 3 Interrupt Flag */
#define ADC12IFG4          (0x0010u)  /* ADC12 Memory 4 Interrupt Flag */
#define ADC12IFG5          (0x0020u)  /* ADC12 Memory 5 Interrupt Flag */
#define ADC12IFG6          (0x0040u)  /* ADC12 Memory 6 Interrupt Flag */
#define ADC12IFG7          (0x0080u)  /* ADC12 Memory 7 Interrupt Flag */
#define ADC12IFG8          (0x0100u)  /* ADC12 Memory 8 Interrupt Flag */
#define ADC12IFG9          (0x0200u)  /* ADC12 Memory 9 Interrupt Flag */
#define ADC12IFG10          (0x0400u)  /* ADC12 Memory 10 Interrupt Flag */
#define ADC12IFG11          (0x0800u)  /* ADC12 Memory 11 Interrupt Flag */
#define ADC12IFG12          (0x1000u)  /* ADC12 Memory 12 Interrupt Flag */
#define ADC12IFG13          (0x2000u)  /* ADC12 Memory 13 Interrupt Flag */
#define ADC12IFG14          (0x4000u)  /* ADC12 Memory 14 Interrupt Flag */
#define ADC12IFG15          (0x8000u)  /* ADC12 Memory 15 Interrupt Flag */

/* ADC12IFGR0 Control Bits */
#define ADC12IFG0_L         (0x0001u)  /* ADC12 Memory 0 Interrupt Flag */
#define ADC12IFG1_L         (0x0002u)  /* ADC12 Memory 1 Interrupt Flag */
#define ADC12IFG2_L         (0x0004u)  /* ADC12 Memory 2 Interrupt Flag */
#define ADC12IFG3_L         (0x0008u)  /* ADC12 Memory 3 Interrupt Flag */
#define ADC12IFG4_L         (0x0010u)  /* ADC12 Memory 4 Interrupt Flag */
#define ADC12IFG5_L         (0x0020u)  /* ADC12 Memory 5 Interrupt Flag */
#define ADC12IFG6_L         (0x0040u)  /* ADC12 Memory 6 Interrupt Flag */
#define ADC12IFG7_L         (0x0080u)  /* ADC12 Memory 7 Interrupt Flag */

/* ADC12IFGR0 Control Bits */
#define ADC12IFG8_H         (0x0001u)  /* ADC12 Memory 8 Interrupt Flag */
#define ADC12IFG9_H         (0x0002u)  /* ADC12 Memory 9 Interrupt Flag */
#define ADC12IFG10_H        (0x0004u)  /* ADC12 Memory 10 Interrupt Flag */
#define ADC12IFG11_H        (0x0008u)  /* ADC12 Memory 11 Interrupt Flag */
#define ADC12IFG12_H        (0x0010u)  /* ADC12 Memory 12 Interrupt Flag */
#define ADC12IFG13_H        (0x0020u)  /* ADC12 Memory 13 Interrupt Flag */
#define ADC12IFG14_H        (0x0040u)  /* ADC12 Memory 14 Interrupt Flag */
#define ADC12IFG15_H        (0x0080u)  /* ADC12 Memory 15 Interrupt Flag */

/* ADC12IFGR1 Control Bits */
#define ADC12IFG16          (0x0001u)  /* ADC12 Memory 16 Interrupt Flag */
#define ADC12IFG17          (0x0002u)  /* ADC12 Memory 17 Interrupt Flag */
#define ADC12IFG18          (0x0004u)  /* ADC12 Memory 18 Interrupt Flag */
#define ADC12IFG19          (0x0008u)  /* ADC12 Memory 19 Interrupt Flag */
#define ADC12IFG20          (0x0010u)  /* ADC12 Memory 20 Interrupt Flag */
#define ADC12IFG21          (0x0020u)  /* ADC12 Memory 21 Interrupt Flag */
#define ADC12IFG22          (0x0040u)  /* ADC12 Memory 22 Interrupt Flag */
#define ADC12IFG23          (0x0080u)  /* ADC12 Memory 23 Interrupt Flag */
#define ADC12IFG24          (0x0100u)  /* ADC12 Memory 24 Interrupt Flag */
#define ADC12IFG25          (0x0200u)  /* ADC12 Memory 25 Interrupt Flag */
#define ADC12IFG26          (0x0400u)  /* ADC12 Memory 26 Interrupt Flag */
#define ADC12IFG27          (0x0800u)  /* ADC12 Memory 27 Interrupt Flag */
#define ADC12IFG28          (0x1000u)  /* ADC12 Memory 28 Interrupt Flag */
#define ADC12IFG29          (0x2000u)  /* ADC12 Memory 29 Interrupt Flag */
#define ADC12IFG30          (0x4000u)  /* ADC12 Memory 30 Interrupt Flag */
#define ADC12IFG31          (0x8000u)  /* ADC12 Memory 31 Interrupt Flag */

/* ADC12IFGR1 Control Bits */
#define ADC12IFG16_L        (0x0001u)  /* ADC12 Memory 16 Interrupt Flag */
#define ADC12IFG17_L        (0x0002u)  /* ADC12 Memory 17 Interrupt Flag */
#define ADC12IFG18_L        (0x0004u)  /* ADC12 Memory 18 Interrupt Flag */
#define ADC12IFG19_L        (0x0008u)  /* ADC12 Memory 19 Interrupt Flag */
#define ADC12IFG20_L        (0x0010u)  /* ADC12 Memory 20 Interrupt Flag */
#define ADC12IFG21_L        (0x0020u)  /* ADC12 Memory 21 Interrupt Flag */
#define ADC12IFG22_L        (0x0040u)  /* ADC12 Memory 22 Interrupt Flag */
#define ADC12IFG23_L        (0x0080u)  /* ADC12 Memory 23 Interrupt Flag */

/* ADC12IFGR1 Control Bits */
#define ADC12IFG24_H        (0x0001u)  /* ADC12 Memory 24 Interrupt Flag */
#define ADC12IFG25_H        (0x0002u)  /* ADC12 Memory 25 Interrupt Flag */
#define ADC12IFG26_H        (0x0004u)  /* ADC12 Memory 26 Interrupt Flag */
#define ADC12IFG27_H        (0x0008u)  /* ADC12 Memory 27 Interrupt Flag */
#define ADC12IFG28_H        (0x0010u)  /* ADC12 Memory 28 Interrupt Flag */
#define ADC12IFG29_H        (0x0020u)  /* ADC12 Memory 29 Interrupt Flag */
#define ADC12IFG30_H        (0x0040u)  /* ADC12 Memory 30 Interrupt Flag */
#define ADC12IFG31_H        (0x0080u)  /* ADC12 Memory 31 Interrupt Flag */

/* ADC12IFGR2 Control Bits */
#define ADC12INIFG          (0x0002u)    /* ADC12 Interrupt Flag for the inside of window of the Window comparator */
#define ADC12LOIFG          (0x0004u)    /* ADC12 Interrupt Flag for lower threshold of the Window comparator */
#define ADC12HIIFG          (0x0008u)    /* ADC12 Interrupt Flag for upper threshold of the Window comparator */
#define ADC12OVIFG          (0x0010u)    /* ADC12 ADC12MEMx Overflow interrupt Flag */
#define ADC12TOVIFG         (0x0020u)    /* ADC12 Timer Overflow interrupt Flag */
#define ADC12RDYIFG         (0x0040u)    /* ADC12 local buffered reference ready interrupt Flag */

/* ADC12IFGR2 Control Bits */
#define ADC12INIFG_L        (0x0002u)    /* ADC12 Interrupt Flag for the inside of window of the Window comparator */
#define ADC12LOIFG_L        (0x0004u)    /* ADC12 Interrupt Flag for lower threshold of the Window comparator */
#define ADC12HIIFG_L        (0x0008u)    /* ADC12 Interrupt Flag for upper threshold of the Window comparator */
#define ADC12OVIFG_L        (0x0010u)    /* ADC12 ADC12MEMx Overflow interrupt Flag */
#define ADC12TOVIFG_L       (0x0020u)    /* ADC12 Timer Overflow interrupt Flag */
#define ADC12RDYIFG_L       (0x0040u)    /* ADC12 local buffered reference ready interrupt Flag */

/* ADC12IV Definitions */
#define ADC12IV_NONE        (0x0000u)    /* No Interrupt pending */
#define ADC12IV_ADC12OVIFG  (0x0002u)    /* ADC12OVIFG */
#define ADC12IV_ADC12TOVIFG (0x0004u)    /* ADC12TOVIFG */
#define ADC12IV_ADC12HIIFG  (0x0006u)    /* ADC12HIIFG */
#define ADC12IV_ADC12LOIFG  (0x0008u)    /* ADC12LOIFG */
#define ADC12IV_ADC12INIFG  (0x000Au)    /* ADC12INIFG */
#define ADC12IV_ADC12IFG0   (0x000Cu)    /* ADC12IFG0 */
#define ADC12IV_ADC12IFG1   (0x000Eu)    /* ADC12IFG1 */
#define ADC12IV_ADC12IFG2   (0x0010u)    /* ADC12IFG2 */
#define ADC12IV_ADC12IFG3   (0x0012u)    /* ADC12IFG3 */
#define ADC12IV_ADC12IFG4   (0x0014u)    /* ADC12IFG4 */
#define ADC12IV_ADC12IFG5   (0x0016u)    /* ADC12IFG5 */
#define ADC12IV_ADC12IFG6   (0x0018u)    /* ADC12IFG6 */
#define ADC12IV_ADC12IFG7   (0x001Au)    /* ADC12IFG7 */
#define ADC12IV_ADC12IFG8   (0x001Cu)    /* ADC12IFG8 */
#define ADC12IV_ADC12IFG9   (0x001Eu)    /* ADC12IFG9 */
#define ADC12IV_ADC12IFG10  (0x0020u)    /* ADC12IFG10 */
#define ADC12IV_ADC12IFG11  (0x0022u)    /* ADC12IFG11 */
#define ADC12IV_ADC12IFG12  (0x0024u)    /* ADC12IFG12 */
#define ADC12IV_ADC12IFG13  (0x0026u)    /* ADC12IFG13 */
#define ADC12IV_ADC12IFG14  (0x0028u)    /* ADC12IFG14 */
#define ADC12IV_ADC12IFG15  (0x002Au)    /* ADC12IFG15 */
#define ADC12IV_ADC12IFG16  (0x002Cu)    /* ADC12IFG16 */
#define ADC12IV_ADC12IFG17  (0x002Eu)    /* ADC12IFG17 */
#define ADC12IV_ADC12IFG18  (0x0030u)    /* ADC12IFG18 */
#define ADC12IV_ADC12IFG19  (0x0032u)    /* ADC12IFG19 */
#define ADC12IV_ADC12IFG20  (0x0034u)    /* ADC12IFG20 */
#define ADC12IV_ADC12IFG21  (0x0036u)    /* ADC12IFG21 */
#define ADC12IV_ADC12IFG22  (0x0038u)    /* ADC12IFG22 */
#define ADC12IV_ADC12IFG23  (0x003Au)    /* ADC12IFG23 */
#define ADC12IV_ADC12IFG24  (0x003Cu)    /* ADC12IFG24 */
#define ADC12IV_ADC12IFG25  (0x003Eu)    /* ADC12IFG25 */
#define ADC12IV_ADC12IFG26  (0x0040u)    /* ADC12IFG26 */
#define ADC12IV_ADC12IFG27  (0x0042u)    /* ADC12IFG27 */
#define ADC12IV_ADC12IFG28  (0x0044u)    /* ADC12IFG28 */
#define ADC12IV_ADC12IFG29  (0x0046u)    /* ADC12IFG29 */
#define ADC12IV_ADC12IFG30  (0x0048u)    /* ADC12IFG30 */
#define ADC12IV_ADC12IFG31  (0x004Au)    /* ADC12IFG31 */
#define ADC12IV_ADC12RDYIFG (0x004Cu)    /* ADC12RDYIFG */


#endif
/************************************************************
* AES256 Accelerator
************************************************************/
#ifdef  __MSP430_HAS_AES256__          /* Definition to show that Module is available */

