arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
#define OFS_AESACTL0          (0x0000u)  /* AES accelerator control register 0 */
#define OFS_AESACTL0_L         OFS_AESACTL0
#define OFS_AESACTL0_H         OFS_AESACTL0+1
#define OFS_AESACTL1          (0x0002u)  /* AES accelerator control register 1 */
#define OFS_AESACTL1_L         OFS_AESACTL1
#define OFS_AESACTL1_H         OFS_AESACTL1+1
#define OFS_AESASTAT          (0x0004u)  /* AES accelerator status register */
#define OFS_AESASTAT_L         OFS_AESASTAT
#define OFS_AESASTAT_H         OFS_AESASTAT+1
#define OFS_AESAKEY           (0x0006u)  /* AES accelerator key register */
#define OFS_AESAKEY_L          OFS_AESAKEY
#define OFS_AESAKEY_H          OFS_AESAKEY+1
#define OFS_AESADIN           (0x0008u)  /* AES accelerator data in register */
#define OFS_AESADIN_L          OFS_AESADIN
#define OFS_AESADIN_H          OFS_AESADIN+1
#define OFS_AESADOUT          (0x000Au)  /* AES accelerator data out register  */
#define OFS_AESADOUT_L         OFS_AESADOUT
#define OFS_AESADOUT_H         OFS_AESADOUT+1
#define OFS_AESAXDIN          (0x000Cu)  /* AES accelerator XORed data in register */
#define OFS_AESAXDIN_L         OFS_AESAXDIN
#define OFS_AESAXDIN_H         OFS_AESAXDIN+1
#define OFS_AESAXIN           (0x000Eu)  /* AES accelerator XORed data in register (no trigger)  */
#define OFS_AESAXIN_L          OFS_AESAXIN
#define OFS_AESAXIN_H          OFS_AESAXIN+1

/* AESACTL0 Control Bits */
#define AESOP0              (0x0001u)  /* AES Operation Bit: 0 */
#define AESOP1              (0x0002u)  /* AES Operation Bit: 1 */
#define AESKL0              (0x0004u)  /* AES Key length Bit: 0 */
#define AESKL1              (0x0008u)  /* AES Key length Bit: 1 */
#define AESTRIG             (0x0010u)  /* AES Trigger Select */
#define AESCM0              (0x0020u)  /* AES Cipher mode select Bit: 0 */
#define AESCM1              (0x0040u)  /* AES Cipher mode select Bit: 1 */
#define AESSWRST            (0x0080u)  /* AES Software Reset */
#define AESRDYIFG           (0x0100u)  /* AES ready interrupt flag */
#define AESERRFG            (0x0800u)  /* AES Error Flag */
#define AESRDYIE            (0x1000u)  /* AES ready interrupt enable*/
#define AESCMEN             (0x8000u)  /* AES DMA cipher mode enable*/

/* AESACTL0 Control Bits */
#define AESOP0_L            (0x0001u)  /* AES Operation Bit: 0 */
#define AESOP1_L            (0x0002u)  /* AES Operation Bit: 1 */
#define AESKL0_L            (0x0004u)  /* AES Key length Bit: 0 */
#define AESKL1_L            (0x0008u)  /* AES Key length Bit: 1 */
#define AESTRIG_L           (0x0010u)  /* AES Trigger Select */
#define AESCM0_L            (0x0020u)  /* AES Cipher mode select Bit: 0 */
#define AESCM1_L            (0x0040u)  /* AES Cipher mode select Bit: 1 */
#define AESSWRST_L          (0x0080u)  /* AES Software Reset */

/* AESACTL0 Control Bits */
#define AESRDYIFG_H         (0x0001u)  /* AES ready interrupt flag */
#define AESERRFG_H          (0x0008u)  /* AES Error Flag */
#define AESRDYIE_H          (0x0010u)  /* AES ready interrupt enable*/
#define AESCMEN_H           (0x0080u)  /* AES DMA cipher mode enable*/

#define AESOP_0             (0x0000u)  /* AES Operation: Encrypt */
#define AESOP_1             (0x0001u)  /* AES Operation: Decrypt (same Key) */
#define AESOP_2             (0x0002u)  /* AES Operation: Decrypt (frist round Key) */
#define AESOP_3             (0x0003u)  /* AES Operation: Generate first round Key */

#define AESKL_0             (0x0000u)  /* AES Key length: AES128 */
#define AESKL_1             (0x0004u)  /* AES Key length: AES192 */
#define AESKL_2             (0x0008u)  /* AES Key length: AES256 */
#define AESKL__128          (0x0000u)  /* AES Key length: AES128 */
#define AESKL__192          (0x0004u)  /* AES Key length: AES192 */
#define AESKL__256          (0x0008u)  /* AES Key length: AES256 */

#define AESCM_0             (0x0000u)  /* AES Cipher mode select: ECB */
#define AESCM_1             (0x0020u)  /* AES Cipher mode select: CBC */
#define AESCM_2             (0x0040u)  /* AES Cipher mode select: OFB */
#define AESCM_3             (0x0060u)  /* AES Cipher mode select: CFB */
#define AESCM__ECB          (0x0000u)  /* AES Cipher mode select: ECB */
#define AESCM__CBC          (0x0020u)  /* AES Cipher mode select: CBC */
#define AESCM__OFB          (0x0040u)  /* AES Cipher mode select: OFB */
#define AESCM__CFB          (0x0060u)  /* AES Cipher mode select: CFB */

/* AESACTL1 Control Bits */
#define AESBLKCNT0          (0x0001u)  /* AES Cipher Block Counter Bit: 0 */
#define AESBLKCNT1          (0x0002u)  /* AES Cipher Block Counter Bit: 1 */
#define AESBLKCNT2          (0x0004u)  /* AES Cipher Block Counter Bit: 2 */
#define AESBLKCNT3          (0x0008u)  /* AES Cipher Block Counter Bit: 3 */
#define AESBLKCNT4          (0x0010u)  /* AES Cipher Block Counter Bit: 4 */
#define AESBLKCNT5          (0x0020u)  /* AES Cipher Block Counter Bit: 5 */
#define AESBLKCNT6          (0x0040u)  /* AES Cipher Block Counter Bit: 6 */
#define AESBLKCNT7          (0x0080u)  /* AES Cipher Block Counter Bit: 7 */

/* AESACTL1 Control Bits */
#define AESBLKCNT0_L        (0x0001u)  /* AES Cipher Block Counter Bit: 0 */
#define AESBLKCNT1_L        (0x0002u)  /* AES Cipher Block Counter Bit: 1 */
#define AESBLKCNT2_L        (0x0004u)  /* AES Cipher Block Counter Bit: 2 */
#define AESBLKCNT3_L        (0x0008u)  /* AES Cipher Block Counter Bit: 3 */
#define AESBLKCNT4_L        (0x0010u)  /* AES Cipher Block Counter Bit: 4 */
#define AESBLKCNT5_L        (0x0020u)  /* AES Cipher Block Counter Bit: 5 */
#define AESBLKCNT6_L        (0x0040u)  /* AES Cipher Block Counter Bit: 6 */
#define AESBLKCNT7_L        (0x0080u)  /* AES Cipher Block Counter Bit: 7 */

/* AESASTAT Control Bits */
#define AESBUSY             (0x0001u)  /* AES Busy */
#define AESKEYWR            (0x0002u)  /* AES All 16 bytes written to AESAKEY */
#define AESDINWR            (0x0004u)  /* AES All 16 bytes written to AESADIN */
#define AESDOUTRD           (0x0008u)  /* AES All 16 bytes read from AESADOUT */
#define AESKEYCNT0          (0x0010u)  /* AES Bytes written via AESAKEY Bit: 0 */
#define AESKEYCNT1          (0x0020u)  /* AES Bytes written via AESAKEY Bit: 1 */
#define AESKEYCNT2          (0x0040u)  /* AES Bytes written via AESAKEY Bit: 2 */
#define AESKEYCNT3          (0x0080u)  /* AES Bytes written via AESAKEY Bit: 3 */
#define AESDINCNT0          (0x0100u)  /* AES Bytes written via AESADIN Bit: 0 */
#define AESDINCNT1          (0x0200u)  /* AES Bytes written via AESADIN Bit: 1 */
#define AESDINCNT2          (0x0400u)  /* AES Bytes written via AESADIN Bit: 2 */
#define AESDINCNT3          (0x0800u)  /* AES Bytes written via AESADIN Bit: 3 */
#define AESDOUTCNT0         (0x1000u)  /* AES Bytes read via AESADOUT Bit: 0 */
#define AESDOUTCNT1         (0x2000u)  /* AES Bytes read via AESADOUT Bit: 1 */
#define AESDOUTCNT2         (0x4000u)  /* AES Bytes read via AESADOUT Bit: 2 */
#define AESDOUTCNT3         (0x8000u)  /* AES Bytes read via AESADOUT Bit: 3 */

/* AESASTAT Control Bits */
#define AESBUSY_L           (0x0001u)  /* AES Busy */
#define AESKEYWR_L          (0x0002u)  /* AES All 16 bytes written to AESAKEY */
#define AESDINWR_L          (0x0004u)  /* AES All 16 bytes written to AESADIN */
#define AESDOUTRD_L         (0x0008u)  /* AES All 16 bytes read from AESADOUT */
#define AESKEYCNT0_L        (0x0010u)  /* AES Bytes written via AESAKEY Bit: 0 */
#define AESKEYCNT1_L        (0x0020u)  /* AES Bytes written via AESAKEY Bit: 1 */
#define AESKEYCNT2_L        (0x0040u)  /* AES Bytes written via AESAKEY Bit: 2 */
#define AESKEYCNT3_L        (0x0080u)  /* AES Bytes written via AESAKEY Bit: 3 */

/* AESASTAT Control Bits */
#define AESDINCNT0_H        (0x0001u)  /* AES Bytes written via AESADIN Bit: 0 */
#define AESDINCNT1_H        (0x0002u)  /* AES Bytes written via AESADIN Bit: 1 */
#define AESDINCNT2_H        (0x0004u)  /* AES Bytes written via AESADIN Bit: 2 */
#define AESDINCNT3_H        (0x0008u)  /* AES Bytes written via AESADIN Bit: 3 */
#define AESDOUTCNT0_H       (0x0010u)  /* AES Bytes read via AESADOUT Bit: 0 */
#define AESDOUTCNT1_H       (0x0020u)  /* AES Bytes read via AESADOUT Bit: 1 */
#define AESDOUTCNT2_H       (0x0040u)  /* AES Bytes read via AESADOUT Bit: 2 */
#define AESDOUTCNT3_H       (0x0080u)  /* AES Bytes read via AESADOUT Bit: 3 */

#endif
/************************************************************
* Capacitive_Touch_IO 0
************************************************************/
#ifdef  __MSP430_HAS_CAP_TOUCH_IO_0__ /* Definition to show that Module is available */

