arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
#define DIVS_0              (0x0000u)    /* SMCLK Source Divider 0 */
#define DIVS_1              (0x0010u)    /* SMCLK Source Divider 1 */
#define DIVS_2              (0x0020u)    /* SMCLK Source Divider 2 */
#define DIVS_3              (0x0030u)    /* SMCLK Source Divider 3 */
#define DIVS_4              (0x0040u)    /* SMCLK Source Divider 4 */
#define DIVS_5              (0x0050u)    /* SMCLK Source Divider 5 */
#define DIVS__1             (0x0000u)    /* SMCLK Source Divider f(SMCLK)/1 */
#define DIVS__2             (0x0010u)    /* SMCLK Source Divider f(SMCLK)/2 */
#define DIVS__4             (0x0020u)    /* SMCLK Source Divider f(SMCLK)/4 */
#define DIVS__8             (0x0030u)    /* SMCLK Source Divider f(SMCLK)/8 */
#define DIVS__16            (0x0040u)    /* SMCLK Source Divider f(SMCLK)/16 */
#define DIVS__32            (0x0050u)    /* SMCLK Source Divider f(SMCLK)/32 */

#define DIVA_0              (0x0000u)    /* ACLK Source Divider 0 */
#define DIVA_1              (0x0100u)    /* ACLK Source Divider 1 */
#define DIVA_2              (0x0200u)    /* ACLK Source Divider 2 */
#define DIVA_3              (0x0300u)    /* ACLK Source Divider 3 */
#define DIVA_4              (0x0400u)    /* ACLK Source Divider 4 */
#define DIVA_5              (0x0500u)    /* ACLK Source Divider 5 */
#define DIVA__1             (0x0000u)    /* ACLK Source Divider f(ACLK)/1 */
#define DIVA__2             (0x0100u)    /* ACLK Source Divider f(ACLK)/2 */
#define DIVA__4             (0x0200u)    /* ACLK Source Divider f(ACLK)/4 */
#define DIVA__8             (0x0300u)    /* ACLK Source Divider f(ACLK)/8 */
#define DIVA__16            (0x0400u)    /* ACLK Source Divider f(ACLK)/16 */
#define DIVA__32            (0x0500u)    /* ACLK Source Divider f(ACLK)/32 */

/* CSCTL4 Control Bits */
#define LFXTOFF             (0x0001u)    /* High Frequency Oscillator 1 (XT1) disable */
#define SMCLKOFF            (0x0002u)    /* SMCLK Off */
#define VLOOFF              (0x0008u)    /* VLO Off */
#define LFXTBYPASS          (0x0010u)    /* LFXT bypass mode : 0: internal 1:sourced from external pin */
#define LFXTAGCOFF          (0x0020u)    /* LFXT automatic gain control off */
#define LFXTDRIVE0          (0x0040u)    /* LFXT Drive Level mode Bit 0 */
#define LFXTDRIVE1          (0x0080u)    /* LFXT Drive Level mode Bit 1 */
#define HFXTOFF             (0x0100u)    /* High Frequency Oscillator disable */
#define HFFREQ0             (0x0400u)    /* HFXT frequency selection Bit 1 */
#define HFFREQ1             (0x0800u)    /* HFXT frequency selection Bit 0 */
#define HFXTBYPASS          (0x1000u)    /* HFXT bypass mode : 0: internal 1:sourced from external pin */
#define HFXTDRIVE0          (0x4000u)    /* HFXT Drive Level mode Bit 0 */
#define HFXTDRIVE1          (0x8000u)    /* HFXT Drive Level mode Bit 1 */

/* CSCTL4 Control Bits */
#define LFXTOFF_L           (0x0001u)    /* High Frequency Oscillator 1 (XT1) disable */
#define SMCLKOFF_L          (0x0002u)    /* SMCLK Off */
#define VLOOFF_L            (0x0008u)    /* VLO Off */
#define LFXTBYPASS_L        (0x0010u)    /* LFXT bypass mode : 0: internal 1:sourced from external pin */
#define LFXTAGCOFF_L        (0x0020u)    /* LFXT automatic gain control off */
#define LFXTDRIVE0_L        (0x0040u)    /* LFXT Drive Level mode Bit 0 */
#define LFXTDRIVE1_L        (0x0080u)    /* LFXT Drive Level mode Bit 1 */

/* CSCTL4 Control Bits */
#define HFXTOFF_H           (0x0001u)    /* High Frequency Oscillator disable */
#define HFFREQ0_H           (0x0004u)    /* HFXT frequency selection Bit 1 */
#define HFFREQ1_H           (0x0008u)    /* HFXT frequency selection Bit 0 */
#define HFXTBYPASS_H        (0x0010u)    /* HFXT bypass mode : 0: internal 1:sourced from external pin */
#define HFXTDRIVE0_H        (0x0040u)    /* HFXT Drive Level mode Bit 0 */
#define HFXTDRIVE1_H        (0x0080u)    /* HFXT Drive Level mode Bit 1 */

#define LFXTDRIVE_0         (0x0000u)    /* LFXT Drive Level mode: 0 */
#define LFXTDRIVE_1         (0x0040u)    /* LFXT Drive Level mode: 1 */
#define LFXTDRIVE_2         (0x0080u)    /* LFXT Drive Level mode: 2 */
#define LFXTDRIVE_3         (0x00C0u)    /* LFXT Drive Level mode: 3 */

#define HFFREQ_0            (0x0000u)    /* HFXT frequency selection: 0 */
#define HFFREQ_1            (0x0400u)    /* HFXT frequency selection: 1 */
#define HFFREQ_2            (0x0800u)    /* HFXT frequency selection: 2 */
#define HFFREQ_3            (0x0C00u)    /* HFXT frequency selection: 3 */

#define HFXTDRIVE_0         (0x0000u)    /* HFXT Drive Level mode: 0 */
#define HFXTDRIVE_1         (0x4000u)    /* HFXT Drive Level mode: 1 */
#define HFXTDRIVE_2         (0x8000u)    /* HFXT Drive Level mode: 2 */
#define HFXTDRIVE_3         (0xC000u)    /* HFXT Drive Level mode: 3 */

/* CSCTL5 Control Bits */
#define LFXTOFFG            (0x0001u)    /* LFXT Low Frequency Oscillator Fault Flag */
#define HFXTOFFG            (0x0002u)    /* HFXT High Frequency Oscillator Fault Flag */
#define ENSTFCNT1           (0x0040u)    /* Enable start counter for XT1 */
#define ENSTFCNT2           (0x0080u)    /* Enable start counter for XT2 */

/* CSCTL5 Control Bits */
#define LFXTOFFG_L          (0x0001u)    /* LFXT Low Frequency Oscillator Fault Flag */
#define HFXTOFFG_L          (0x0002u)    /* HFXT High Frequency Oscillator Fault Flag */
#define ENSTFCNT1_L         (0x0040u)    /* Enable start counter for XT1 */
#define ENSTFCNT2_L         (0x0080u)    /* Enable start counter for XT2 */

/* CSCTL6 Control Bits */
#define ACLKREQEN           (0x0001u)    /* ACLK Clock Request Enable */
#define MCLKREQEN           (0x0002u)    /* MCLK Clock Request Enable */
#define SMCLKREQEN          (0x0004u)    /* SMCLK Clock Request Enable */
#define MODCLKREQEN         (0x0008u)    /* MODOSC Clock Request Enable */

/* CSCTL6 Control Bits */
#define ACLKREQEN_L         (0x0001u)    /* ACLK Clock Request Enable */
#define MCLKREQEN_L         (0x0002u)    /* MCLK Clock Request Enable */
#define SMCLKREQEN_L        (0x0004u)    /* SMCLK Clock Request Enable */
#define MODCLKREQEN_L       (0x0008u)    /* MODOSC Clock Request Enable */

#endif
/************************************************************
* DMA_X
************************************************************/
#ifdef  __MSP430_HAS_DMAX_3__           /* Definition to show that Module is available */

