arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
#define ESIIV_NONE          (0x0000u)      /* No ESI Interrupt Pending */
#define ESIIV_ESIIFG1       (0x0002u)      /* rising edge of the ESISTOP(tsm) */
#define ESIIV_ESIIFG0       (0x0004u)      /* ESIOUT0 to ESIOUT3 conditions selected by ESIIFGSETx bits */
#define ESIIV_ESIIFG8       (0x0006u)      /* ESIOUT4 to ESIOUT7 conditions selected by ESIIFGSET2x bits */
#define ESIIV_ESIIFG3       (0x0008u)      /* ESICNT1 counter conditions selected with the ESITHR1 and ESITHR2 registers */
#define ESIIV_ESIIFG6       (0x000Au)      /* PSM transitions to a state with a Q7 bit */
#define ESIIV_ESIIFG5       (0x000Cu)      /* PSM transitions to a state with a Q6 bit */
#define ESIIV_ESIIFG4       (0x000Eu)      /* ESICNT2 counter conditions selected with the ESIIS2x bits */
#define ESIIV_ESIIFG7       (0x0010u)      /* ESICNT0 counter conditions selected with the ESIIS0x bits */
#define ESIIV_ESIIFG2       (0x0012u)      /* start of a TSM sequence */

/* ESIINT1 Control Bits */
#define ESIIFGSET22         (0x8000u)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET21         (0x4000u)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET20         (0x2000u)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET12         (0x1000u)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET11         (0x0800u)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET10         (0x0400u)      /* ESIIFG0 interrupt flag source */
#define ESIIE8              (0x0100u)      /* Interrupt enable */
#define ESIIE7              (0x0080u)      /* Interrupt enable */
#define ESIIE6              (0x0040u)      /* Interrupt enable */
#define ESIIE5              (0x0020u)      /* Interrupt enable */
#define ESIIE4              (0x0010u)      /* Interrupt enable */
#define ESIIE3              (0x0008u)      /* Interrupt enable */
#define ESIIE2              (0x0004u)      /* Interrupt enable */
#define ESIIE1              (0x0002u)      /* Interrupt enable */
#define ESIIE0              (0x0001u)      /* Interrupt enable */

/* ESIINT1 Control Bits */
#define ESIIE7_L            (0x0080u)      /* Interrupt enable */
#define ESIIE6_L            (0x0040u)      /* Interrupt enable */
#define ESIIE5_L            (0x0020u)      /* Interrupt enable */
#define ESIIE4_L            (0x0010u)      /* Interrupt enable */
#define ESIIE3_L            (0x0008u)      /* Interrupt enable */
#define ESIIE2_L            (0x0004u)      /* Interrupt enable */
#define ESIIE1_L            (0x0002u)      /* Interrupt enable */
#define ESIIE0_L            (0x0001u)      /* Interrupt enable */

/* ESIINT1 Control Bits */
#define ESIIFGSET22_H       (0x0080u)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET21_H       (0x0040u)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET20_H       (0x0020u)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET12_H       (0x0010u)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET11_H       (0x0008u)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET10_H       (0x0004u)      /* ESIIFG0 interrupt flag source */
#define ESIIE8_H            (0x0001u)      /* Interrupt enable */

#define ESIIFGSET2_0        (0x0000u)      /* ESIIFG8 is set when ESIOUT4 is set */
#define ESIIFGSET2_1        (0x2000u)      /* ESIIFG8 is set when ESIOUT4 is reset */
#define ESIIFGSET2_2        (0x4000u)      /* ESIIFG8 is set when ESIOUT5 is set */
#define ESIIFGSET2_3        (0x6000u)      /* ESIIFG8 is set when ESIOUT5 is reset */
#define ESIIFGSET2_4        (0x8000u)      /* ESIIFG8 is set when ESIOUT6 is set */
#define ESIIFGSET2_5        (0xA000u)      /* ESIIFG8 is set when ESIOUT6 is reset */
#define ESIIFGSET2_6        (0xC000u)      /* ESIIFG8 is set when ESIOUT7 is set */
#define ESIIFGSET2_7        (0xE000u)      /* ESIIFG8 is set when ESIOUT7 is reset */
#define ESIIFGSET1_0        (0x0000u)      /* ESIIFG0 is set when ESIOUT0 is set */
#define ESIIFGSET1_1        (0x0400u)      /* ESIIFG0 is set when ESIOUT0 is reset */
#define ESIIFGSET1_2        (0x0800u)      /* ESIIFG0 is set when ESIOUT1 is set */
#define ESIIFGSET1_3        (0x0C00u)      /* ESIIFG0 is set when ESIOUT1 is reset */
#define ESIIFGSET1_4        (0x1000u)      /* ESIIFG0 is set when ESIOUT2 is set */
#define ESIIFGSET1_5        (0x1400u)      /* ESIIFG0 is set when ESIOUT2 is reset */
#define ESIIFGSET1_6        (0x1800u)      /* ESIIFG0 is set when ESIOUT3 is set */
#define ESIIFGSET1_7        (0x1C00u)      /* ESIIFG0 is set when ESIOUT3 is reset */

/* ESIINT2 Control Bits */
#define ESIIS21             (0x4000u)      /* SIFIFG4 interrupt flag source */
#define ESIIS20             (0x2000u)      /* SIFIFG4 interrupt flag source */
#define ESIIS01             (0x0800u)      /* SIFIFG7 interrupt flag source */
#define ESIIS00             (0x0400u)      /* SIFIFG7 interrupt flag source */
#define ESIIFG8             (0x0100u)      /* ESIIFG8 interrupt pending */
#define ESIIFG7             (0x0080u)      /* ESIIFG7 interrupt pending */
#define ESIIFG6             (0x0040u)      /* ESIIFG6 interrupt pending */
#define ESIIFG5             (0x0020u)      /* ESIIFG5 interrupt pending */
#define ESIIFG4             (0x0010u)      /* ESIIFG4 interrupt pending */
#define ESIIFG3             (0x0008u)      /* ESIIFG3 interrupt pending */
#define ESIIFG2             (0x0004u)      /* ESIIFG2 interrupt pending */
#define ESIIFG1             (0x0002u)      /* ESIIFG1 interrupt pending */
#define ESIIFG0             (0x0001u)      /* ESIIFG0 interrupt pending */

/* ESIINT2 Control Bits */
#define ESIIFG7_L           (0x0080u)      /* ESIIFG7 interrupt pending */
#define ESIIFG6_L           (0x0040u)      /* ESIIFG6 interrupt pending */
#define ESIIFG5_L           (0x0020u)      /* ESIIFG5 interrupt pending */
#define ESIIFG4_L           (0x0010u)      /* ESIIFG4 interrupt pending */
#define ESIIFG3_L           (0x0008u)      /* ESIIFG3 interrupt pending */
#define ESIIFG2_L           (0x0004u)      /* ESIIFG2 interrupt pending */
#define ESIIFG1_L           (0x0002u)      /* ESIIFG1 interrupt pending */
#define ESIIFG0_L           (0x0001u)      /* ESIIFG0 interrupt pending */

/* ESIINT2 Control Bits */
#define ESIIS21_H           (0x0040u)      /* SIFIFG4 interrupt flag source */
#define ESIIS20_H           (0x0020u)      /* SIFIFG4 interrupt flag source */
#define ESIIS01_H           (0x0008u)      /* SIFIFG7 interrupt flag source */
#define ESIIS00_H           (0x0004u)      /* SIFIFG7 interrupt flag source */
#define ESIIFG8_H           (0x0001u)      /* ESIIFG8 interrupt pending */

