arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
#define ESIIS2_0            (0x0000u)      /* SIFIFG4 interrupt flag source: SIFCNT2 */
#define ESIIS2_1            (0x2000u)      /* SIFIFG4 interrupt flag source: SIFCNT2 MOD 4 */
#define ESIIS2_2            (0x4000u)      /* SIFIFG4 interrupt flag source: SIFCNT2 MOD 256 */
#define ESIIS2_3            (0x6000u)      /* SIFIFG4 interrupt flag source: SIFCNT2 decrements from 01h to 00h */
#define ESIIS0_0            (0x0000u)      /* SIFIFG7 interrupt flag source: SIFCNT0 */
#define ESIIS0_1            (0x0400u)      /* SIFIFG7 interrupt flag source: SIFCNT0 MOD 4 */
#define ESIIS0_2            (0x0800u)      /* SIFIFG7 interrupt flag source: SIFCNT0 MOD 256 */
#define ESIIS0_3            (0x0C00u)      /* SIFIFG7 interrupt flag source: SIFCNT0 increments from FFFFh to 00h */

/* ESIAFE Control Bits */
#define ESIDAC2EN           (0x0800u)      /* Enable ESIDAC(tsm) control for DAC in AFE2 */
#define ESICA2EN            (0x0400u)      /* Enable ESICA(tsm) control for comparator in AFE2 */
#define ESICA2INV           (0x0200u)      /* Invert AFE2's comparator output */
#define ESICA1INV           (0x0100u)      /* Invert AFE1's comparator output */
#define ESICA2X             (0x0080u)      /* AFE2's comparator input select */
#define ESICA1X             (0x0040u)      /* AFE1's comparator input select */
#define ESICISEL            (0x0020u)      /* Comparator input select for AFE1 only */
#define ESICACI3            (0x0010u)      /* Comparator input select for AFE1 only */
#define ESIVSS              (0x0008u)      /* Sample-and-hold ESIVSS select */
#define ESIVCC2             (0x0004u)      /* Mid-voltage generator */
#define ESISH               (0x0002u)      /* Sample-and-hold enable */
#define ESITEN              (0x0001u)      /* Excitation enable */

/* ESIAFE Control Bits */
#define ESICA2X_L           (0x0080u)      /* AFE2's comparator input select */
#define ESICA1X_L           (0x0040u)      /* AFE1's comparator input select */
#define ESICISEL_L          (0x0020u)      /* Comparator input select for AFE1 only */
#define ESICACI3_L          (0x0010u)      /* Comparator input select for AFE1 only */
#define ESIVSS_L            (0x0008u)      /* Sample-and-hold ESIVSS select */
#define ESIVCC2_L           (0x0004u)      /* Mid-voltage generator */
#define ESISH_L             (0x0002u)      /* Sample-and-hold enable */
#define ESITEN_L            (0x0001u)      /* Excitation enable */

/* ESIAFE Control Bits */
#define ESIDAC2EN_H         (0x0008u)      /* Enable ESIDAC(tsm) control for DAC in AFE2 */
#define ESICA2EN_H          (0x0004u)      /* Enable ESICA(tsm) control for comparator in AFE2 */
#define ESICA2INV_H         (0x0002u)      /* Invert AFE2's comparator output */
#define ESICA1INV_H         (0x0001u)      /* Invert AFE1's comparator output */

/* ESIPPU Control Bits */
#define ESITCHOUT1          (0x0200u)      /* Latched AFE1 comparator output for test channel 1 */
#define ESITCHOUT0          (0x0100u)      /* Lachted AFE1 comparator output for test channel 0 */
#define ESIOUT7             (0x0080u)      /* Latched AFE2 comparator output when ESICH3 input is selected */
#define ESIOUT6             (0x0040u)      /* Latched AFE2 comparator output when ESICH2 input is selected */
#define ESIOUT5             (0x0020u)      /* Latched AFE2 comparator output when ESICH1 input is selected */
#define ESIOUT4             (0x0010u)      /* Latched AFE2 comparator output when ESICH0 input is selected */
#define ESIOUT3             (0x0008u)      /* Latched AFE1 comparator output when ESICH3 input is selected */
#define ESIOUT2             (0x0004u)      /* Latched AFE1 comparator output when ESICH2 input is selected */
#define ESIOUT1             (0x0002u)      /* Latched AFE1 comparator output when ESICH1 input is selected */
#define ESIOUT0             (0x0001u)      /* Latched AFE1 comparator output when ESICH0 input is selected */

/* ESIPPU Control Bits */
#define ESIOUT7_L           (0x0080u)      /* Latched AFE2 comparator output when ESICH3 input is selected */
#define ESIOUT6_L           (0x0040u)      /* Latched AFE2 comparator output when ESICH2 input is selected */
#define ESIOUT5_L           (0x0020u)      /* Latched AFE2 comparator output when ESICH1 input is selected */
#define ESIOUT4_L           (0x0010u)      /* Latched AFE2 comparator output when ESICH0 input is selected */
#define ESIOUT3_L           (0x0008u)      /* Latched AFE1 comparator output when ESICH3 input is selected */
#define ESIOUT2_L           (0x0004u)      /* Latched AFE1 comparator output when ESICH2 input is selected */
#define ESIOUT1_L           (0x0002u)      /* Latched AFE1 comparator output when ESICH1 input is selected */
#define ESIOUT0_L           (0x0001u)      /* Latched AFE1 comparator output when ESICH0 input is selected */

/* ESIPPU Control Bits */
#define ESITCHOUT1_H        (0x0002u)      /* Latched AFE1 comparator output for test channel 1 */
#define ESITCHOUT0_H        (0x0001u)      /* Lachted AFE1 comparator output for test channel 0 */

/* ESITSM Control Bits */
#define ESICLKAZSEL         (0x4000u)      /* Functionality selection of ESITSMx bit5 */
#define ESITSMTRG1          (0x2000u)      /* TSM start trigger selection */
#define ESITSMTRG0          (0x1000u)      /* TSM start trigger selection */
#define ESISTART            (0x0800u)      /* TSM software start trigger */
#define ESITSMRP            (0x0400u)      /* TSM repeat modee */
#define ESIDIV3B2           (0x0200u)      /* TSM start trigger ACLK divider */
#define ESIDIV3B1           (0x0100u)      /* TSM start trigger ACLK divider */
#define ESIDIV3B0           (0x0080u)      /* TSM start trigger ACLK divider */
#define ESIDIV3A2           (0x0040u)      /* TSM start trigger ACLK divider */
#define ESIDIV3A1           (0x0020u)      /* TSM start trigger ACLK divider */
#define ESIDIV3A0           (0x0010u)      /* TSM start trigger ACLK divider */
#define ESIDIV21            (0x0008u)      /* ACLK divider */
#define ESIDIV20            (0x0004u)      /* ACLK divider */
#define ESIDIV11            (0x0002u)      /* TSM SMCLK divider */
#define ESIDIV10            (0x0001u)      /* TSM SMCLK divider */

