arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
/* ESIOSC Control Bits */
#define ESICLKFQ5           (0x2000u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ4           (0x1000u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ3           (0x0800u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ2           (0x0400u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ1           (0x0200u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ0           (0x0100u)      /* Internal oscillator frequency adjust */
#define ESICLKGON           (0x0002u)      /* Internal oscillator control */
#define ESIHFSEL            (0x0001u)      /* Internal oscillator enable */

/* ESIOSC Control Bits */
#define ESICLKGON_L         (0x0002u)      /* Internal oscillator control */
#define ESIHFSEL_L          (0x0001u)      /* Internal oscillator enable */

/* ESIOSC Control Bits */
#define ESICLKFQ5_H         (0x0020u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ4_H         (0x0010u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ3_H         (0x0008u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ2_H         (0x0004u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ1_H         (0x0002u)      /* Internal oscillator frequency adjust */
#define ESICLKFQ0_H         (0x0001u)      /* Internal oscillator frequency adjust */

/* ESICTL Control Bits */
#define ESIS3SEL2           (0x8000u)      /* PPUS3 source select */
#define ESIS3SEL1           (0x4000u)      /* PPUS3 source select */
#define ESIS3SEL0           (0x2000u)      /* PPUS3 source select */
#define ESIS2SEL2           (0x1000u)      /* PPUS2 source select */
#define ESIS2SEL1           (0x0800u)      /* PPUS2 source select */
#define ESIS2SEL0           (0x0400u)      /* PPUS2 source select */
#define ESIS1SEL2           (0x0200u)      /* PPUS1 source select */
#define ESIS1SEL1           (0x0100u)      /* PPUS1 source select */
#define ESIS1SEL0           (0x0080u)      /* PPUS1 source select */
#define ESITCH11            (0x0040u)      /* select the comparator input for test channel 1 */
#define ESITCH10            (0x0020u)      /* select the comparator input for test channel 1 */
#define ESITCH01            (0x0010u)      /* select the comparator input for test channel 0 */
#define ESITCH00            (0x0008u)      /* select the comparator input for test channel 0 */
#define ESICS               (0x0004u)      /* Comparator output/Timer_A input selection */
#define ESITESTD            (0x0002u)      /* Test cycle insertion */
#define ESIEN               (0x0001u)      /* Extended Scan interface enable */

/* ESICTL Control Bits */
#define ESIS1SEL0_L         (0x0080u)      /* PPUS1 source select */
#define ESITCH11_L          (0x0040u)      /* select the comparator input for test channel 1 */
#define ESITCH10_L          (0x0020u)      /* select the comparator input for test channel 1 */
#define ESITCH01_L          (0x0010u)      /* select the comparator input for test channel 0 */
#define ESITCH00_L          (0x0008u)      /* select the comparator input for test channel 0 */
#define ESICS_L             (0x0004u)      /* Comparator output/Timer_A input selection */
#define ESITESTD_L          (0x0002u)      /* Test cycle insertion */
#define ESIEN_L             (0x0001u)      /* Extended Scan interface enable */

/* ESICTL Control Bits */
#define ESIS3SEL2_H         (0x0080u)      /* PPUS3 source select */
#define ESIS3SEL1_H         (0x0040u)      /* PPUS3 source select */
#define ESIS3SEL0_H         (0x0020u)      /* PPUS3 source select */
#define ESIS2SEL2_H         (0x0010u)      /* PPUS2 source select */
#define ESIS2SEL1_H         (0x0008u)      /* PPUS2 source select */
#define ESIS2SEL0_H         (0x0004u)      /* PPUS2 source select */
#define ESIS1SEL2_H         (0x0002u)      /* PPUS1 source select */
#define ESIS1SEL1_H         (0x0001u)      /* PPUS1 source select */

#define ESIS3SEL_0          (0x0000u)      /* ESIOUT0 is the PPUS3 source */
#define ESIS3SEL_1          (0x2000u)      /* ESIOUT1 is the PPUS3 source */
#define ESIS3SEL_2          (0x4000u)      /* ESIOUT2 is the PPUS3 source */
#define ESIS3SEL_3          (0x6000u)      /* ESIOUT3 is the PPUS3 source */
#define ESIS3SEL_4          (0x8000u)      /* ESIOUT4 is the PPUS3 source */
#define ESIS3SEL_5          (0xA000u)      /* ESIOUT5 is the PPUS3 source */
#define ESIS3SEL_6          (0xC000u)      /* ESIOUT6 is the PPUS3 source */
#define ESIS3SEL_7          (0xE000u)      /* ESIOUT7 is the PPUS3 source */
#define ESIS2SEL_0          (0x0000u)      /* ESIOUT0 is the PPUS2 source */
#define ESIS2SEL_1          (0x0400u)      /* ESIOUT1 is the PPUS2 source */
#define ESIS2SEL_2          (0x0800u)      /* ESIOUT2 is the PPUS2 source */
#define ESIS2SEL_3          (0x0C00u)      /* ESIOUT3 is the PPUS2 source */
#define ESIS2SEL_4          (0x1000u)      /* ESIOUT4 is the PPUS2 source */
#define ESIS2SEL_5          (0x1400u)      /* ESIOUT5 is the PPUS2 source */
#define ESIS2SEL_6          (0x1800u)      /* ESIOUT6 is the PPUS2 source */
#define ESIS2SEL_7          (0x1C00u)      /* ESIOUT7 is the PPUS2 source */
#define ESIS1SEL_0          (0x0000u)      /* ESIOUT0 is the PPUS1 source */
#define ESIS1SEL_1          (0x0080u)      /* ESIOUT1 is the PPUS1 source */
#define ESIS1SEL_2          (0x0100u)      /* ESIOUT2 is the PPUS1 source */
#define ESIS1SEL_3          (0x0180u)      /* ESIOUT3 is the PPUS1 source */
#define ESIS1SEL_4          (0x0200u)      /* ESIOUT4 is the PPUS1 source */
#define ESIS1SEL_5          (0x0280u)      /* ESIOUT5 is the PPUS1 source */
#define ESIS1SEL_6          (0x0300u)      /* ESIOUT6 is the PPUS1 source */
#define ESIS1SEL_7          (0x0380u)      /* ESIOUT7 is the PPUS1 source */
#define ESITCH1_0           (0x0000u)      /* Comparator input is ESICH0 when ESICAX = 0; Comparator input is ESICI0 when ESICAX = 1 */
#define ESITCH1_1           (0x0400u)      /* Comparator input is ESICH1 when ESICAX = 0; Comparator input is ESICI1 when ESICAX = 1 */
#define ESITCH1_2           (0x0800u)      /* Comparator input is ESICH2 when ESICAX = 0; Comparator input is ESICI2 when ESICAX = 1 */
#define ESITCH1_3           (0x0C00u)      /* Comparator input is ESICH3 when ESICAX = 0; Comparator input is ESICI3 when ESICAX = 1 */
#define ESITCH0_0           (0x0000u)      /* Comparator input is ESICH0 when ESICAX = 0; Comparator input is ESICI0 when ESICAX = 1 */
#define ESITCH0_1           (0x0008u)      /* Comparator input is ESICH1 when ESICAX = 0; Comparator input is ESICI1 when ESICAX = 1 */
#define ESITCH0_2           (0x0010u)      /* Comparator input is ESICH2 when ESICAX = 0; Comparator input is ESICI2 when ESICAX = 1 */
#define ESITCH0_3           (0x0018u)      /* Comparator input is ESICH3 when ESICAX = 0; Comparator input is ESICI3 when ESICAX = 1 */

/* Timing State Machine Control Bits */
#define ESIREPEAT4          (0x8000u)      /* These bits together with the ESICLK bit configure the duration of this state */
#define ESIREPEAT3          (0x4000u)      /* ESIREPEATx selects the number of clock cycles for this state. The number of clock cycles = ESIREPEATx + 1 */
#define ESIREPEAT2          (0x2000u)      /* */
#define ESIREPEAT1          (0x1000u)      /* */
#define ESIREPEAT0          (0x0800u)      /* */
#define ESICLK              (0x0400u)      /* This bit selects the clock source for the TSM */
#define ESISTOP             (0x0200u)      /* This bit indicates the end of the TSM sequence */
#define ESIDAC              (0x0100u)      /* TSM DAC on */
#define ESITESTS1           (0x0080u)      /* TSM test cycle control */
#define ESIRSON             (0x0040u)      /* Internal output latches enabled */
#define ESICLKON            (0x0020u)      /* High-frequency clock on */
#define ESICA               (0x0010u)      /* TSM comparator on */
#define ESIEX               (0x0008u)      /* Excitation and sample-and-hold */
#define ESILCEN             (0x0004u)      /* LC enable */
#define ESICH1              (0x0002u)      /* Input channel select */
#define ESICH0              (0x0001u)      /* Input channel select */

/* Timing State Machine Control Bits */
#define ESITESTS1_L         (0x0080u)      /* TSM test cycle control */
#define ESIRSON_L           (0x0040u)      /* Internal output latches enabled */
#define ESICLKON_L          (0x0020u)      /* High-frequency clock on */
#define ESICA_L             (0x0010u)      /* TSM comparator on */
#define ESIEX_L             (0x0008u)      /* Excitation and sample-and-hold */
#define ESILCEN_L           (0x0004u)      /* LC enable */
#define ESICH1_L            (0x0002u)      /* Input channel select */
#define ESICH0_L            (0x0001u)      /* Input channel select */

/* Timing State Machine Control Bits */
#define ESIREPEAT4_H        (0x0080u)      /* These bits together with the ESICLK bit configure the duration of this state */
#define ESIREPEAT3_H        (0x0040u)      /* ESIREPEATx selects the number of clock cycles for this state. The number of clock cycles = ESIREPEATx + 1 */
#define ESIREPEAT2_H        (0x0020u)      /* */
#define ESIREPEAT1_H        (0x0010u)      /* */
#define ESIREPEAT0_H        (0x0008u)      /* */
#define ESICLK_H            (0x0004u)      /* This bit selects the clock source for the TSM */
#define ESISTOP_H           (0x0002u)      /* This bit indicates the end of the TSM sequence */
#define ESIDAC_H            (0x0001u)      /* TSM DAC on */

#define ESICAAZ             (0x0020u)      /* Comparator Offset calibration annulation */

#define ESIREPEAT_0         (0x0000u)      /* These bits configure the duration of this state */
#define ESIREPEAT_1         (0x0800u)      /* ESIREPEATx selects the number of clock cycles for this state. The number of clock cycles = ESIREPEATx + 1 */
#define ESIREPEAT_2         (0x1000u)
#define ESIREPEAT_3         (0x1800u)
#define ESIREPEAT_4         (0x2000u)
#define ESIREPEAT_5         (0x2800u)
#define ESIREPEAT_6         (0x3000u)
#define ESIREPEAT_7         (0x3800u)
#define ESIREPEAT_8         (0x4000u)
#define ESIREPEAT_9         (0x4800u)
#define ESIREPEAT_10        (0x5000u)
#define ESIREPEAT_11        (0x5800u)
#define ESIREPEAT_12        (0x6000u)
#define ESIREPEAT_13        (0x6800u)
#define ESIREPEAT_14        (0x7000u)
#define ESIREPEAT_15        (0x7800u)
#define ESIREPEAT_16        (0x8000u)
#define ESIREPEAT_17        (0x8800u)
#define ESIREPEAT_18        (0x9000u)
#define ESIREPEAT_19        (0x9800u)
#define ESIREPEAT_20        (0xA000u)
#define ESIREPEAT_21        (0xA800u)
#define ESIREPEAT_22        (0xB000u)
#define ESIREPEAT_23        (0xB800u)
#define ESIREPEAT_24        (0xC000u)
#define ESIREPEAT_25        (0xC800u)
#define ESIREPEAT_26        (0xD000u)
#define ESIREPEAT_27        (0xD800u)
#define ESIREPEAT_28        (0xE000u)
#define ESIREPEAT_29        (0xE800u)
#define ESIREPEAT_30        (0xF000u)
#define ESIREPEAT_31        (0xF800u)
#define ESICH_0             (0x0000u)      /* Input channel select: ESICH0 */
#define ESICH_1             (0x0001u)      /* Input channel select: ESICH1 */
#define ESICH_2             (0x0002u)      /* Input channel select: ESICH2 */
#define ESICH_3             (0x0003u)      /* Input channel select: ESICH3 */
#endif
/************************************************************
* EXTENDED SCAN INTERFACE RAM
************************************************************/
#ifdef  __MSP430_HAS_ESI_RAM__            /* Definition to show that Module is available */

