arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
#define OFS_ESIRAM0           (0x0000u)      /* ESI RAM 0 */
#define OFS_ESIRAM1           (0x0001u)      /* ESI RAM 1 */
#define OFS_ESIRAM2           (0x0002u)      /* ESI RAM 2 */
#define OFS_ESIRAM3           (0x0003u)      /* ESI RAM 3 */
#define OFS_ESIRAM4           (0x0004u)      /* ESI RAM 4 */
#define OFS_ESIRAM5           (0x0005u)      /* ESI RAM 5 */
#define OFS_ESIRAM6           (0x0006u)      /* ESI RAM 6 */
#define OFS_ESIRAM7           (0x0007u)      /* ESI RAM 7 */
#define OFS_ESIRAM8           (0x0008u)      /* ESI RAM 8 */
#define OFS_ESIRAM9           (0x0009u)      /* ESI RAM 9 */
#define OFS_ESIRAM10          (0x000Au)      /* ESI RAM 10 */
#define OFS_ESIRAM11          (0x000Bu)      /* ESI RAM 11 */
#define OFS_ESIRAM12          (0x000Cu)      /* ESI RAM 12 */
#define OFS_ESIRAM13          (0x000Du)      /* ESI RAM 13 */
#define OFS_ESIRAM14          (0x000Eu)      /* ESI RAM 14 */
#define OFS_ESIRAM15          (0x000Fu)      /* ESI RAM 15 */
#define OFS_ESIRAM16          (0x0010u)      /* ESI RAM 16 */
#define OFS_ESIRAM17          (0x0011u)      /* ESI RAM 17 */
#define OFS_ESIRAM18          (0x0012u)      /* ESI RAM 18 */
#define OFS_ESIRAM19          (0x0013u)      /* ESI RAM 19 */
#define OFS_ESIRAM20          (0x0014u)      /* ESI RAM 20 */
#define OFS_ESIRAM21          (0x0015u)      /* ESI RAM 21 */
#define OFS_ESIRAM22          (0x0016u)      /* ESI RAM 22 */
#define OFS_ESIRAM23          (0x0017u)      /* ESI RAM 23 */
#define OFS_ESIRAM24          (0x0018u)      /* ESI RAM 24 */
#define OFS_ESIRAM25          (0x0019u)      /* ESI RAM 25 */
#define OFS_ESIRAM26          (0x001Au)      /* ESI RAM 26 */
#define OFS_ESIRAM27          (0x001Bu)      /* ESI RAM 27 */
#define OFS_ESIRAM28          (0x001Cu)      /* ESI RAM 28 */
#define OFS_ESIRAM29          (0x001Du)      /* ESI RAM 29 */
#define OFS_ESIRAM30          (0x001Eu)      /* ESI RAM 30 */
#define OFS_ESIRAM31          (0x001Fu)      /* ESI RAM 31 */
#define OFS_ESIRAM32          (0x0020u)      /* ESI RAM 32 */
#define OFS_ESIRAM33          (0x0021u)      /* ESI RAM 33 */
#define OFS_ESIRAM34          (0x0022u)      /* ESI RAM 34 */
#define OFS_ESIRAM35          (0x0023u)      /* ESI RAM 35 */
#define OFS_ESIRAM36          (0x0024u)      /* ESI RAM 36 */
#define OFS_ESIRAM37          (0x0025u)      /* ESI RAM 37 */
#define OFS_ESIRAM38          (0x0026u)      /* ESI RAM 38 */
#define OFS_ESIRAM39          (0x0027u)      /* ESI RAM 39 */
#define OFS_ESIRAM40          (0x0028u)      /* ESI RAM 40 */
#define OFS_ESIRAM41          (0x0029u)      /* ESI RAM 41 */
#define OFS_ESIRAM42          (0x002Au)      /* ESI RAM 42 */
#define OFS_ESIRAM43          (0x002Bu)      /* ESI RAM 43 */
#define OFS_ESIRAM44          (0x002Cu)      /* ESI RAM 44 */
#define OFS_ESIRAM45          (0x002Du)      /* ESI RAM 45 */
#define OFS_ESIRAM46          (0x002Eu)      /* ESI RAM 46 */
#define OFS_ESIRAM47          (0x002Fu)      /* ESI RAM 47 */
#define OFS_ESIRAM48          (0x0030u)      /* ESI RAM 48 */
#define OFS_ESIRAM49          (0x0031u)      /* ESI RAM 49 */
#define OFS_ESIRAM50          (0x0032u)      /* ESI RAM 50 */
#define OFS_ESIRAM51          (0x0033u)      /* ESI RAM 51 */
#define OFS_ESIRAM52          (0x0034u)      /* ESI RAM 52 */
#define OFS_ESIRAM53          (0x0035u)      /* ESI RAM 53 */
#define OFS_ESIRAM54          (0x0036u)      /* ESI RAM 54 */
#define OFS_ESIRAM55          (0x0037u)      /* ESI RAM 55 */
#define OFS_ESIRAM56          (0x0038u)      /* ESI RAM 56 */
#define OFS_ESIRAM57          (0x0039u)      /* ESI RAM 57 */
#define OFS_ESIRAM58          (0x003Au)      /* ESI RAM 58 */
#define OFS_ESIRAM59          (0x003Bu)      /* ESI RAM 59 */
#define OFS_ESIRAM60          (0x003Cu)      /* ESI RAM 60 */
#define OFS_ESIRAM61          (0x003Du)      /* ESI RAM 61 */
#define OFS_ESIRAM62          (0x003Eu)      /* ESI RAM 62 */
#define OFS_ESIRAM63          (0x003Fu)      /* ESI RAM 63 */
#define OFS_ESIRAM64          (0x0040u)      /* ESI RAM 64 */
#define OFS_ESIRAM65          (0x0041u)      /* ESI RAM 65 */
#define OFS_ESIRAM66          (0x0042u)      /* ESI RAM 66 */
#define OFS_ESIRAM67          (0x0043u)      /* ESI RAM 67 */
#define OFS_ESIRAM68          (0x0044u)      /* ESI RAM 68 */
#define OFS_ESIRAM69          (0x0045u)      /* ESI RAM 69 */
#define OFS_ESIRAM70          (0x0046u)      /* ESI RAM 70 */
#define OFS_ESIRAM71          (0x0047u)      /* ESI RAM 71 */
#define OFS_ESIRAM72          (0x0048u)      /* ESI RAM 72 */
#define OFS_ESIRAM73          (0x0049u)      /* ESI RAM 73 */
#define OFS_ESIRAM74          (0x004Au)      /* ESI RAM 74 */
#define OFS_ESIRAM75          (0x004Bu)      /* ESI RAM 75 */
#define OFS_ESIRAM76          (0x004Cu)      /* ESI RAM 76 */
#define OFS_ESIRAM77          (0x004Du)      /* ESI RAM 77 */
#define OFS_ESIRAM78          (0x004Eu)      /* ESI RAM 78 */
#define OFS_ESIRAM79          (0x004Fu)      /* ESI RAM 79 */
#define OFS_ESIRAM80          (0x0050u)      /* ESI RAM 80 */
#define OFS_ESIRAM81          (0x0051u)      /* ESI RAM 81 */
#define OFS_ESIRAM82          (0x0052u)      /* ESI RAM 82 */
#define OFS_ESIRAM83          (0x0053u)      /* ESI RAM 83 */
#define OFS_ESIRAM84          (0x0054u)      /* ESI RAM 84 */
#define OFS_ESIRAM85          (0x0055u)      /* ESI RAM 85 */
#define OFS_ESIRAM86          (0x0056u)      /* ESI RAM 86 */
#define OFS_ESIRAM87          (0x0057u)      /* ESI RAM 87 */
#define OFS_ESIRAM88          (0x0058u)      /* ESI RAM 88 */
#define OFS_ESIRAM89          (0x0059u)      /* ESI RAM 89 */
#define OFS_ESIRAM90          (0x005Au)      /* ESI RAM 90 */
#define OFS_ESIRAM91          (0x005Bu)      /* ESI RAM 91 */
#define OFS_ESIRAM92          (0x005Cu)      /* ESI RAM 92 */
#define OFS_ESIRAM93          (0x005Du)      /* ESI RAM 93 */
#define OFS_ESIRAM94          (0x005Eu)      /* ESI RAM 94 */
#define OFS_ESIRAM95          (0x005Fu)      /* ESI RAM 95 */
#define OFS_ESIRAM96          (0x0060u)      /* ESI RAM 96 */
#define OFS_ESIRAM97          (0x0061u)      /* ESI RAM 97 */
#define OFS_ESIRAM98          (0x0062u)      /* ESI RAM 98 */
#define OFS_ESIRAM99          (0x0063u)      /* ESI RAM 99 */
#define OFS_ESIRAM100         (0x0064u)      /* ESI RAM 100 */
#define OFS_ESIRAM101         (0x0065u)      /* ESI RAM 101 */
#define OFS_ESIRAM102         (0x0066u)      /* ESI RAM 102 */
#define OFS_ESIRAM103         (0x0067u)      /* ESI RAM 103 */
#define OFS_ESIRAM104         (0x0068u)      /* ESI RAM 104 */
#define OFS_ESIRAM105         (0x0069u)      /* ESI RAM 105 */
#define OFS_ESIRAM106         (0x006Au)      /* ESI RAM 106 */
#define OFS_ESIRAM107         (0x006Bu)      /* ESI RAM 107 */
#define OFS_ESIRAM108         (0x006Cu)      /* ESI RAM 108 */
#define OFS_ESIRAM109         (0x006Du)      /* ESI RAM 109 */
#define OFS_ESIRAM110         (0x006Eu)      /* ESI RAM 110 */
#define OFS_ESIRAM111         (0x006Fu)      /* ESI RAM 111 */
#define OFS_ESIRAM112         (0x0070u)      /* ESI RAM 112 */
#define OFS_ESIRAM113         (0x0071u)      /* ESI RAM 113 */
#define OFS_ESIRAM114         (0x0072u)      /* ESI RAM 114 */
#define OFS_ESIRAM115         (0x0073u)      /* ESI RAM 115 */
#define OFS_ESIRAM116         (0x0074u)      /* ESI RAM 116 */
#define OFS_ESIRAM117         (0x0075u)      /* ESI RAM 117 */
#define OFS_ESIRAM118         (0x0076u)      /* ESI RAM 118 */
#define OFS_ESIRAM119         (0x0077u)      /* ESI RAM 119 */
#define OFS_ESIRAM120         (0x0078u)      /* ESI RAM 120 */
#define OFS_ESIRAM121         (0x0079u)      /* ESI RAM 121 */
#define OFS_ESIRAM122         (0x007Au)      /* ESI RAM 122 */
#define OFS_ESIRAM123         (0x007Bu)      /* ESI RAM 123 */
#define OFS_ESIRAM124         (0x007Cu)      /* ESI RAM 124 */
#define OFS_ESIRAM125         (0x007Du)      /* ESI RAM 125 */
#define OFS_ESIRAM126         (0x007Eu)      /* ESI RAM 126 */
#define OFS_ESIRAM127         (0x007Fu)      /* ESI RAM 127 */
#endif
/*************************************************************
* FRAM Memory
*************************************************************/
#ifdef  __MSP430_HAS_FRAM__           /* Definition to show that Module is available */

