arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
// LCDCCTL0
#define LCDON               (0x0001u)  /* LCD_C LCD On */
#define LCDLP               (0x0002u)  /* LCD_C Low Power Waveform */
#define LCDSON              (0x0004u)  /* LCD_C LCD Segments On */
#define LCDMX0              (0x0008u)  /* LCD_C Mux Rate Bit: 0 */
#define LCDMX1              (0x0010u)  /* LCD_C Mux Rate Bit: 1 */
#define LCDMX2              (0x0020u)  /* LCD_C Mux Rate Bit: 2 */
//#define RESERVED            (0x0040u)  /* LCD_C RESERVED */
#define LCDSSEL             (0x0080u)  /* LCD_C Clock Select */
#define LCDPRE0             (0x0100u)  /* LCD_C LCD frequency pre-scaler Bit: 0 */
#define LCDPRE1             (0x0200u)  /* LCD_C LCD frequency pre-scaler Bit: 1 */
#define LCDPRE2             (0x0400u)  /* LCD_C LCD frequency pre-scaler Bit: 2 */
#define LCDDIV0             (0x0800u)  /* LCD_C LCD frequency divider Bit: 0 */
#define LCDDIV1             (0x1000u)  /* LCD_C LCD frequency divider Bit: 1 */
#define LCDDIV2             (0x2000u)  /* LCD_C LCD frequency divider Bit: 2 */
#define LCDDIV3             (0x4000u)  /* LCD_C LCD frequency divider Bit: 3 */
#define LCDDIV4             (0x8000u)  /* LCD_C LCD frequency divider Bit: 4 */

// LCDCCTL0
#define LCDON_L             (0x0001u)  /* LCD_C LCD On */
#define LCDLP_L             (0x0002u)  /* LCD_C Low Power Waveform */
#define LCDSON_L            (0x0004u)  /* LCD_C LCD Segments On */
#define LCDMX0_L            (0x0008u)  /* LCD_C Mux Rate Bit: 0 */
#define LCDMX1_L            (0x0010u)  /* LCD_C Mux Rate Bit: 1 */
#define LCDMX2_L            (0x0020u)  /* LCD_C Mux Rate Bit: 2 */
//#define RESERVED            (0x0040u)  /* LCD_C RESERVED */
#define LCDSSEL_L           (0x0080u)  /* LCD_C Clock Select */

// LCDCCTL0
//#define RESERVED            (0x0040u)  /* LCD_C RESERVED */
#define LCDPRE0_H           (0x0001u)  /* LCD_C LCD frequency pre-scaler Bit: 0 */
#define LCDPRE1_H           (0x0002u)  /* LCD_C LCD frequency pre-scaler Bit: 1 */
#define LCDPRE2_H           (0x0004u)  /* LCD_C LCD frequency pre-scaler Bit: 2 */
#define LCDDIV0_H           (0x0008u)  /* LCD_C LCD frequency divider Bit: 0 */
#define LCDDIV1_H           (0x0010u)  /* LCD_C LCD frequency divider Bit: 1 */
#define LCDDIV2_H           (0x0020u)  /* LCD_C LCD frequency divider Bit: 2 */
#define LCDDIV3_H           (0x0040u)  /* LCD_C LCD frequency divider Bit: 3 */
#define LCDDIV4_H           (0x0080u)  /* LCD_C LCD frequency divider Bit: 4 */

#define LCDPRE_0            (0x0000u)  /* LCD_C LCD frequency pre-scaler: /1 */
#define LCDPRE_1            (0x0100u)  /* LCD_C LCD frequency pre-scaler: /2 */
#define LCDPRE_2            (0x0200u)  /* LCD_C LCD frequency pre-scaler: /4 */
#define LCDPRE_3            (0x0300u)  /* LCD_C LCD frequency pre-scaler: /8 */
#define LCDPRE_4            (0x0400u)  /* LCD_C LCD frequency pre-scaler: /16 */
#define LCDPRE_5            (0x0500u)  /* LCD_C LCD frequency pre-scaler: /32 */
#define LCDPRE__1           (0x0000u)  /* LCD_C LCD frequency pre-scaler: /1 */
#define LCDPRE__2           (0x0100u)  /* LCD_C LCD frequency pre-scaler: /2 */
#define LCDPRE__4           (0x0200u)  /* LCD_C LCD frequency pre-scaler: /4 */
#define LCDPRE__8           (0x0300u)  /* LCD_C LCD frequency pre-scaler: /8 */
#define LCDPRE__16          (0x0400u)  /* LCD_C LCD frequency pre-scaler: /16 */
#define LCDPRE__32          (0x0500u)  /* LCD_C LCD frequency pre-scaler: /32 */

#define LCDDIV_0            (0x0000u)  /* LCD_C LCD frequency divider: /1 */
#define LCDDIV_1            (0x0800u)  /* LCD_C LCD frequency divider: /2 */
#define LCDDIV_2            (0x1000u)  /* LCD_C LCD frequency divider: /3 */
#define LCDDIV_3            (0x1800u)  /* LCD_C LCD frequency divider: /4 */
#define LCDDIV_4            (0x2000u)  /* LCD_C LCD frequency divider: /5 */
#define LCDDIV_5            (0x2800u)  /* LCD_C LCD frequency divider: /6 */
#define LCDDIV_6            (0x3000u)  /* LCD_C LCD frequency divider: /7 */
#define LCDDIV_7            (0x3800u)  /* LCD_C LCD frequency divider: /8 */
#define LCDDIV_8            (0x4000u)  /* LCD_C LCD frequency divider: /9 */
#define LCDDIV_9            (0x4800u)  /* LCD_C LCD frequency divider: /10 */
#define LCDDIV_10           (0x5000u)  /* LCD_C LCD frequency divider: /11 */
#define LCDDIV_11           (0x5800u)  /* LCD_C LCD frequency divider: /12 */
#define LCDDIV_12           (0x6000u)  /* LCD_C LCD frequency divider: /13 */
#define LCDDIV_13           (0x6800u)  /* LCD_C LCD frequency divider: /14 */
#define LCDDIV_14           (0x7000u)  /* LCD_C LCD frequency divider: /15 */
#define LCDDIV_15           (0x7800u)  /* LCD_C LCD frequency divider: /16 */
#define LCDDIV_16           (0x8000u)  /* LCD_C LCD frequency divider: /17 */
#define LCDDIV_17           (0x8800u)  /* LCD_C LCD frequency divider: /18 */
#define LCDDIV_18           (0x9000u)  /* LCD_C LCD frequency divider: /19 */
#define LCDDIV_19           (0x9800u)  /* LCD_C LCD frequency divider: /20 */
#define LCDDIV_20           (0xA000u)  /* LCD_C LCD frequency divider: /21 */
#define LCDDIV_21           (0xA800u)  /* LCD_C LCD frequency divider: /22 */
#define LCDDIV_22           (0xB000u)  /* LCD_C LCD frequency divider: /23 */
#define LCDDIV_23           (0xB800u)  /* LCD_C LCD frequency divider: /24 */
#define LCDDIV_24           (0xC000u)  /* LCD_C LCD frequency divider: /25 */
#define LCDDIV_25           (0xC800u)  /* LCD_C LCD frequency divider: /26 */
#define LCDDIV_26           (0xD000u)  /* LCD_C LCD frequency divider: /27 */
#define LCDDIV_27           (0xD800u)  /* LCD_C LCD frequency divider: /28 */
#define LCDDIV_28           (0xE000u)  /* LCD_C LCD frequency divider: /29 */
#define LCDDIV_29           (0xE800u)  /* LCD_C LCD frequency divider: /30 */
#define LCDDIV_30           (0xF000u)  /* LCD_C LCD frequency divider: /31 */
#define LCDDIV_31           (0xF800u)  /* LCD_C LCD frequency divider: /32 */
#define LCDDIV__1           (0x0000u)  /* LCD_C LCD frequency divider: /1 */
#define LCDDIV__2           (0x0800u)  /* LCD_C LCD frequency divider: /2 */
#define LCDDIV__3           (0x1000u)  /* LCD_C LCD frequency divider: /3 */
#define LCDDIV__4           (0x1800u)  /* LCD_C LCD frequency divider: /4 */
#define LCDDIV__5           (0x2000u)  /* LCD_C LCD frequency divider: /5 */
#define LCDDIV__6           (0x2800u)  /* LCD_C LCD frequency divider: /6 */
#define LCDDIV__7           (0x3000u)  /* LCD_C LCD frequency divider: /7 */
#define LCDDIV__8           (0x3800u)  /* LCD_C LCD frequency divider: /8 */
#define LCDDIV__9           (0x4000u)  /* LCD_C LCD frequency divider: /9 */
#define LCDDIV__10          (0x4800u)  /* LCD_C LCD frequency divider: /10 */
#define LCDDIV__11          (0x5000u)  /* LCD_C LCD frequency divider: /11 */
#define LCDDIV__12          (0x5800u)  /* LCD_C LCD frequency divider: /12 */
#define LCDDIV__13          (0x6000u)  /* LCD_C LCD frequency divider: /13 */
#define LCDDIV__14          (0x6800u)  /* LCD_C LCD frequency divider: /14 */
#define LCDDIV__15          (0x7000u)  /* LCD_C LCD frequency divider: /15 */
#define LCDDIV__16          (0x7800u)  /* LCD_C LCD frequency divider: /16 */
#define LCDDIV__17          (0x8000u)  /* LCD_C LCD frequency divider: /17 */
#define LCDDIV__18          (0x8800u)  /* LCD_C LCD frequency divider: /18 */
#define LCDDIV__19          (0x9000u)  /* LCD_C LCD frequency divider: /19 */
#define LCDDIV__20          (0x9800u)  /* LCD_C LCD frequency divider: /20 */
#define LCDDIV__21          (0xA000u)  /* LCD_C LCD frequency divider: /21 */
#define LCDDIV__22          (0xA800u)  /* LCD_C LCD frequency divider: /22 */
#define LCDDIV__23          (0xB000u)  /* LCD_C LCD frequency divider: /23 */
#define LCDDIV__24          (0xB800u)  /* LCD_C LCD frequency divider: /24 */
#define LCDDIV__25          (0xC000u)  /* LCD_C LCD frequency divider: /25 */
#define LCDDIV__26          (0xC800u)  /* LCD_C LCD frequency divider: /26 */
#define LCDDIV__27          (0xD000u)  /* LCD_C LCD frequency divider: /27 */
#define LCDDIV__28          (0xD800u)  /* LCD_C LCD frequency divider: /28 */
#define LCDDIV__29          (0xE000u)  /* LCD_C LCD frequency divider: /29 */
#define LCDDIV__30          (0xE800u)  /* LCD_C LCD frequency divider: /30 */
#define LCDDIV__31          (0xF000u)  /* LCD_C LCD frequency divider: /31 */
#define LCDDIV__32          (0xF800u)  /* LCD_C LCD frequency divider: /32 */

/* Display modes coded with Bits 2-4 */
#define LCDSTATIC           (LCDSON)
#define LCD2MUX             (LCDMX0+LCDSON)
#define LCD3MUX             (LCDMX1+LCDSON)
#define LCD4MUX             (LCDMX1+LCDMX0+LCDSON)
#define LCD5MUX             (LCDMX2+LCDSON)
#define LCD6MUX             (LCDMX2+LCDMX0+LCDSON)
#define LCD7MUX             (LCDMX2+LCDMX1+LCDSON)
#define LCD8MUX             (LCDMX2+LCDMX1+LCDMX0+LCDSON)

// LCDCCTL1
#define LCDFRMIFG           (0x0001u)  /* LCD_C LCD frame interrupt flag */
#define LCDBLKOFFIFG        (0x0002u)  /* LCD_C LCD blinking off interrupt flag, */
#define LCDBLKONIFG         (0x0004u)  /* LCD_C LCD blinking on interrupt flag, */
#define LCDNOCAPIFG         (0x0008u)  /* LCD_C No cpacitance connected interrupt flag */
#define LCDFRMIE            (0x0100u)  /* LCD_C LCD frame interrupt enable */
#define LCDBLKOFFIE         (0x0200u)  /* LCD_C LCD blinking off interrupt flag, */
#define LCDBLKONIE          (0x0400u)  /* LCD_C LCD blinking on interrupt flag, */
#define LCDNOCAPIE          (0x0800u)  /* LCD_C No cpacitance connected interrupt enable */

// LCDCCTL1
#define LCDFRMIFG_L         (0x0001u)  /* LCD_C LCD frame interrupt flag */
#define LCDBLKOFFIFG_L      (0x0002u)  /* LCD_C LCD blinking off interrupt flag, */
#define LCDBLKONIFG_L       (0x0004u)  /* LCD_C LCD blinking on interrupt flag, */
#define LCDNOCAPIFG_L       (0x0008u)  /* LCD_C No cpacitance connected interrupt flag */

// LCDCCTL1
#define LCDFRMIE_H          (0x0001u)  /* LCD_C LCD frame interrupt enable */
#define LCDBLKOFFIE_H       (0x0002u)  /* LCD_C LCD blinking off interrupt flag, */
#define LCDBLKONIE_H        (0x0004u)  /* LCD_C LCD blinking on interrupt flag, */
#define LCDNOCAPIE_H        (0x0008u)  /* LCD_C No cpacitance connected interrupt enable */

// LCDCBLKCTL
#define LCDBLKMOD0          (0x0001u)  /* LCD_C Blinking mode Bit: 0 */
#define LCDBLKMOD1          (0x0002u)  /* LCD_C Blinking mode Bit: 1 */
#define LCDBLKPRE0          (0x0004u)  /* LCD_C Clock pre-scaler for blinking frequency Bit: 0 */
#define LCDBLKPRE1          (0x0008u)  /* LCD_C Clock pre-scaler for blinking frequency Bit: 1 */
#define LCDBLKPRE2          (0x0010u)  /* LCD_C Clock pre-scaler for blinking frequency Bit: 2 */
#define LCDBLKDIV0          (0x0020u)  /* LCD_C Clock divider for blinking frequency Bit: 0 */
#define LCDBLKDIV1          (0x0040u)  /* LCD_C Clock divider for blinking frequency Bit: 1 */
#define LCDBLKDIV2          (0x0080u)  /* LCD_C Clock divider for blinking frequency Bit: 2 */

// LCDCBLKCTL
#define LCDBLKMOD0_L        (0x0001u)  /* LCD_C Blinking mode Bit: 0 */
#define LCDBLKMOD1_L        (0x0002u)  /* LCD_C Blinking mode Bit: 1 */
#define LCDBLKPRE0_L        (0x0004u)  /* LCD_C Clock pre-scaler for blinking frequency Bit: 0 */
#define LCDBLKPRE1_L        (0x0008u)  /* LCD_C Clock pre-scaler for blinking frequency Bit: 1 */
#define LCDBLKPRE2_L        (0x0010u)  /* LCD_C Clock pre-scaler for blinking frequency Bit: 2 */
#define LCDBLKDIV0_L        (0x0020u)  /* LCD_C Clock divider for blinking frequency Bit: 0 */
#define LCDBLKDIV1_L        (0x0040u)  /* LCD_C Clock divider for blinking frequency Bit: 1 */
#define LCDBLKDIV2_L        (0x0080u)  /* LCD_C Clock divider for blinking frequency Bit: 2 */

#define LCDBLKMOD_0         (0x0000u)  /* LCD_C Blinking mode: Off */
#define LCDBLKMOD_1         (0x0001u)  /* LCD_C Blinking mode: Individual */
#define LCDBLKMOD_2         (0x0002u)  /* LCD_C Blinking mode: All */
#define LCDBLKMOD_3         (0x0003u)  /* LCD_C Blinking mode: Switching */

// LCDCMEMCTL
#define LCDDISP             (0x0001u)  /* LCD_C LCD memory registers for display */
#define LCDCLRM             (0x0002u)  /* LCD_C Clear LCD memory */
#define LCDCLRBM            (0x0004u)  /* LCD_C Clear LCD blinking memory */

// LCDCMEMCTL
#define LCDDISP_L           (0x0001u)  /* LCD_C LCD memory registers for display */
#define LCDCLRM_L           (0x0002u)  /* LCD_C Clear LCD memory */
#define LCDCLRBM_L          (0x0004u)  /* LCD_C Clear LCD blinking memory */

// LCDCVCTL
#define LCD2B               (0x0001u)  /* Selects 1/2 bias. */
#define VLCDREF0            (0x0002u)  /* Selects reference voltage for regulated charge pump: 0 */
#define VLCDREF1            (0x0004u)  /* Selects reference voltage for regulated charge pump: 1 */
#define LCDCPEN             (0x0008u)  /* LCD Voltage Charge Pump Enable. */
#define VLCDEXT             (0x0010u)  /* Select external source for VLCD. */
#define LCDEXTBIAS          (0x0020u)  /* V2 - V4 voltage select. */
#define R03EXT              (0x0040u)  /* Selects external connections for LCD mid voltages. */
#define LCDREXT             (0x0080u)  /* Selects external connection for lowest LCD voltage. */
#define VLCD0               (0x0200u)  /* VLCD select: 0 */
#define VLCD1               (0x0400u)  /* VLCD select: 1 */
#define VLCD2               (0x0800u)  /* VLCD select: 2 */
#define VLCD3               (0x1000u)  /* VLCD select: 3 */
#define VLCD4               (0x2000u)  /* VLCD select: 4 */
#define VLCD5               (0x4000u)  /* VLCD select: 5 */

// LCDCVCTL
#define LCD2B_L             (0x0001u)  /* Selects 1/2 bias. */
#define VLCDREF0_L          (0x0002u)  /* Selects reference voltage for regulated charge pump: 0 */
#define VLCDREF1_L          (0x0004u)  /* Selects reference voltage for regulated charge pump: 1 */
#define LCDCPEN_L           (0x0008u)  /* LCD Voltage Charge Pump Enable. */
#define VLCDEXT_L           (0x0010u)  /* Select external source for VLCD. */
#define LCDEXTBIAS_L        (0x0020u)  /* V2 - V4 voltage select. */
#define R03EXT_L            (0x0040u)  /* Selects external connections for LCD mid voltages. */
#define LCDREXT_L           (0x0080u)  /* Selects external connection for lowest LCD voltage. */

// LCDCVCTL
#define VLCD0_H             (0x0002u)  /* VLCD select: 0 */
#define VLCD1_H             (0x0004u)  /* VLCD select: 1 */
#define VLCD2_H             (0x0008u)  /* VLCD select: 2 */
#define VLCD3_H             (0x0010u)  /* VLCD select: 3 */
#define VLCD4_H             (0x0020u)  /* VLCD select: 4 */
#define VLCD5_H             (0x0040u)  /* VLCD select: 5 */

/* Reference voltage source select for the regulated charge pump */
#define VLCDREF_0              (0x0000u)       /* Internal */
#define VLCDREF_1              (0x0002u)       /* External */
#define VLCDREF_2              (0x0004u)       /* Reserved */
#define VLCDREF_3              (0x0006u)       /* Reserved */

/* Charge pump voltage selections */
#define VLCD_0                 (0x0000u)       /* Charge pump disabled */
#define VLCD_1                 (0x0200u)       /* VLCD = 2.60V */
#define VLCD_2                 (0x0400u)       /* VLCD = 2.66V */
#define VLCD_3                 (0x0600u)       /* VLCD = 2.72V */
#define VLCD_4                 (0x0800u)       /* VLCD = 2.78V */
#define VLCD_5                 (0x0A00u)       /* VLCD = 2.84V */
#define VLCD_6                 (0x0C00u)       /* VLCD = 2.90V */
#define VLCD_7                 (0x0E00u)       /* VLCD = 2.96V */
#define VLCD_8                 (0x1000u)       /* VLCD = 3.02V */
#define VLCD_9                 (0x1200u)       /* VLCD = 3.08V */
#define VLCD_10                (0x1400u)       /* VLCD = 3.14V */
#define VLCD_11                (0x1600u)       /* VLCD = 3.20V */
#define VLCD_12                (0x1800u)       /* VLCD = 3.26V */
#define VLCD_13                (0x1A00u)       /* VLCD = 3.32V */
#define VLCD_14                (0x1C00u)       /* VLCD = 3.38V */
#define VLCD_15                (0x1E00u)       /* VLCD = 3.44V */

