arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr5xx_6xxgeneric.h
#define VLCD_DISABLED          (0x0000u)       /* Charge pump disabled */
#define VLCD_2_60              (0x0200u)       /* VLCD = 2.60V */
#define VLCD_2_66              (0x0400u)       /* VLCD = 2.66V */
#define VLCD_2_72              (0x0600u)       /* VLCD = 2.72V */
#define VLCD_2_78              (0x0800u)       /* VLCD = 2.78V */
#define VLCD_2_84              (0x0A00u)       /* VLCD = 2.84V */
#define VLCD_2_90              (0x0C00u)       /* VLCD = 2.90V */
#define VLCD_2_96              (0x0E00u)       /* VLCD = 2.96V */
#define VLCD_3_02              (0x1000u)       /* VLCD = 3.02V */
#define VLCD_3_08              (0x1200u)       /* VLCD = 3.08V */
#define VLCD_3_14              (0x1400u)       /* VLCD = 3.14V */
#define VLCD_3_20              (0x1600u)       /* VLCD = 3.20V */
#define VLCD_3_26              (0x1800u)       /* VLCD = 3.26V */
#define VLCD_3_32              (0x1A00u)       /* VLCD = 3.32V */
#define VLCD_3_38              (0x1C00u)       /* VLCD = 3.38V */
#define VLCD_3_44              (0x1E00u)       /* VLCD = 3.44V */

// LCDCPCTL0
#define LCDS0               (0x0001u)  /* LCD Segment  0 enable. */
#define LCDS1               (0x0002u)  /* LCD Segment  1 enable. */
#define LCDS2               (0x0004u)  /* LCD Segment  2 enable. */
#define LCDS3               (0x0008u)  /* LCD Segment  3 enable. */
#define LCDS4               (0x0010u)  /* LCD Segment  4 enable. */
#define LCDS5               (0x0020u)  /* LCD Segment  5 enable. */
#define LCDS6               (0x0040u)  /* LCD Segment  6 enable. */
#define LCDS7               (0x0080u)  /* LCD Segment  7 enable. */
#define LCDS8               (0x0100u)  /* LCD Segment  8 enable. */
#define LCDS9               (0x0200u)  /* LCD Segment  9 enable. */
#define LCDS10              (0x0400u)  /* LCD Segment 10 enable. */
#define LCDS11              (0x0800u)  /* LCD Segment 11 enable. */
#define LCDS12              (0x1000u)  /* LCD Segment 12 enable. */
#define LCDS13              (0x2000u)  /* LCD Segment 13 enable. */
#define LCDS14              (0x4000u)  /* LCD Segment 14 enable. */
#define LCDS15              (0x8000u)  /* LCD Segment 15 enable. */

// LCDCPCTL0
#define LCDS0_L             (0x0001u)  /* LCD Segment  0 enable. */
#define LCDS1_L             (0x0002u)  /* LCD Segment  1 enable. */
#define LCDS2_L             (0x0004u)  /* LCD Segment  2 enable. */
#define LCDS3_L             (0x0008u)  /* LCD Segment  3 enable. */
#define LCDS4_L             (0x0010u)  /* LCD Segment  4 enable. */
#define LCDS5_L             (0x0020u)  /* LCD Segment  5 enable. */
#define LCDS6_L             (0x0040u)  /* LCD Segment  6 enable. */
#define LCDS7_L             (0x0080u)  /* LCD Segment  7 enable. */

// LCDCPCTL0
#define LCDS8_H             (0x0001u)  /* LCD Segment  8 enable. */
#define LCDS9_H             (0x0002u)  /* LCD Segment  9 enable. */
#define LCDS10_H            (0x0004u)  /* LCD Segment 10 enable. */
#define LCDS11_H            (0x0008u)  /* LCD Segment 11 enable. */
#define LCDS12_H            (0x0010u)  /* LCD Segment 12 enable. */
#define LCDS13_H            (0x0020u)  /* LCD Segment 13 enable. */
#define LCDS14_H            (0x0040u)  /* LCD Segment 14 enable. */
#define LCDS15_H            (0x0080u)  /* LCD Segment 15 enable. */

// LCDCPCTL1
#define LCDS16              (0x0001u)  /* LCD Segment 16 enable. */
#define LCDS17              (0x0002u)  /* LCD Segment 17 enable. */
#define LCDS18              (0x0004u)  /* LCD Segment 18 enable. */
#define LCDS19              (0x0008u)  /* LCD Segment 19 enable. */
#define LCDS20              (0x0010u)  /* LCD Segment 20 enable. */
#define LCDS21              (0x0020u)  /* LCD Segment 21 enable. */
#define LCDS22              (0x0040u)  /* LCD Segment 22 enable. */
#define LCDS23              (0x0080u)  /* LCD Segment 23 enable. */
#define LCDS24              (0x0100u)  /* LCD Segment 24 enable. */
#define LCDS25              (0x0200u)  /* LCD Segment 25 enable. */
#define LCDS26              (0x0400u)  /* LCD Segment 26 enable. */
#define LCDS27              (0x0800u)  /* LCD Segment 27 enable. */
#define LCDS28              (0x1000u)  /* LCD Segment 28 enable. */
#define LCDS29              (0x2000u)  /* LCD Segment 29 enable. */
#define LCDS30              (0x4000u)  /* LCD Segment 30 enable. */
#define LCDS31              (0x8000u)  /* LCD Segment 31 enable. */

// LCDCPCTL1
#define LCDS16_L            (0x0001u)  /* LCD Segment 16 enable. */
#define LCDS17_L            (0x0002u)  /* LCD Segment 17 enable. */
#define LCDS18_L            (0x0004u)  /* LCD Segment 18 enable. */
#define LCDS19_L            (0x0008u)  /* LCD Segment 19 enable. */
#define LCDS20_L            (0x0010u)  /* LCD Segment 20 enable. */
#define LCDS21_L            (0x0020u)  /* LCD Segment 21 enable. */
#define LCDS22_L            (0x0040u)  /* LCD Segment 22 enable. */
#define LCDS23_L            (0x0080u)  /* LCD Segment 23 enable. */

// LCDCPCTL1
#define LCDS24_H            (0x0001u)  /* LCD Segment 24 enable. */
#define LCDS25_H            (0x0002u)  /* LCD Segment 25 enable. */
#define LCDS26_H            (0x0004u)  /* LCD Segment 26 enable. */
#define LCDS27_H            (0x0008u)  /* LCD Segment 27 enable. */
#define LCDS28_H            (0x0010u)  /* LCD Segment 28 enable. */
#define LCDS29_H            (0x0020u)  /* LCD Segment 29 enable. */
#define LCDS30_H            (0x0040u)  /* LCD Segment 30 enable. */
#define LCDS31_H            (0x0080u)  /* LCD Segment 31 enable. */

// LCDCPCTL2
#define LCDS32              (0x0001u)  /* LCD Segment 32 enable. */
#define LCDS33              (0x0002u)  /* LCD Segment 33 enable. */
#define LCDS34              (0x0004u)  /* LCD Segment 34 enable. */
#define LCDS35              (0x0008u)  /* LCD Segment 35 enable. */
#define LCDS36              (0x0010u)  /* LCD Segment 36 enable. */
#define LCDS37              (0x0020u)  /* LCD Segment 37 enable. */
#define LCDS38              (0x0040u)  /* LCD Segment 38 enable. */
#define LCDS39              (0x0080u)  /* LCD Segment 39 enable. */
#define LCDS40              (0x0100u)  /* LCD Segment 40 enable. */
#define LCDS41              (0x0200u)  /* LCD Segment 41 enable. */
#define LCDS42              (0x0400u)  /* LCD Segment 42 enable. */
#define LCDS43              (0x0800u)  /* LCD Segment 43 enable. */
#define LCDS44              (0x1000u)  /* LCD Segment 44 enable. */
#define LCDS45              (0x2000u)  /* LCD Segment 45 enable. */
#define LCDS46              (0x4000u)  /* LCD Segment 46 enable. */
#define LCDS47              (0x8000u)  /* LCD Segment 47 enable. */

// LCDCPCTL2
#define LCDS32_L            (0x0001u)  /* LCD Segment 32 enable. */
#define LCDS33_L            (0x0002u)  /* LCD Segment 33 enable. */
#define LCDS34_L            (0x0004u)  /* LCD Segment 34 enable. */
#define LCDS35_L            (0x0008u)  /* LCD Segment 35 enable. */
#define LCDS36_L            (0x0010u)  /* LCD Segment 36 enable. */
#define LCDS37_L            (0x0020u)  /* LCD Segment 37 enable. */
#define LCDS38_L            (0x0040u)  /* LCD Segment 38 enable. */
#define LCDS39_L            (0x0080u)  /* LCD Segment 39 enable. */

// LCDCPCTL2
#define LCDS40_H            (0x0001u)  /* LCD Segment 40 enable. */
#define LCDS41_H            (0x0002u)  /* LCD Segment 41 enable. */
#define LCDS42_H            (0x0004u)  /* LCD Segment 42 enable. */
#define LCDS43_H            (0x0008u)  /* LCD Segment 43 enable. */
#define LCDS44_H            (0x0010u)  /* LCD Segment 44 enable. */
#define LCDS45_H            (0x0020u)  /* LCD Segment 45 enable. */
#define LCDS46_H            (0x0040u)  /* LCD Segment 46 enable. */
#define LCDS47_H            (0x0080u)  /* LCD Segment 47 enable. */

// LCDCPCTL3
#define LCDS48              (0x0001u)  /* LCD Segment 48 enable. */
#define LCDS49              (0x0002u)  /* LCD Segment 49 enable. */
#define LCDS50              (0x0004u)  /* LCD Segment 50 enable. */
#define LCDS51              (0x0008u)  /* LCD Segment 51 enable. */
#define LCDS52              (0x0010u)  /* LCD Segment 52 enable. */
#define LCDS53              (0x0020u)  /* LCD Segment 53 enable. */

// LCDCPCTL3
#define LCDS48_L            (0x0001u)  /* LCD Segment 48 enable. */
#define LCDS49_L            (0x0002u)  /* LCD Segment 49 enable. */
#define LCDS50_L            (0x0004u)  /* LCD Segment 50 enable. */
#define LCDS51_L            (0x0008u)  /* LCD Segment 51 enable. */
#define LCDS52_L            (0x0010u)  /* LCD Segment 52 enable. */
#define LCDS53_L            (0x0020u)  /* LCD Segment 53 enable. */

// LCDCCPCTL
#define LCDCPDIS0           (0x0001u)  /* LCD charge pump disable */
#define LCDCPDIS1           (0x0002u)  /* LCD charge pump disable */
#define LCDCPDIS2           (0x0004u)  /* LCD charge pump disable */
#define LCDCPDIS3           (0x0008u)  /* LCD charge pump disable */
#define LCDCPDIS4           (0x0010u)  /* LCD charge pump disable */
#define LCDCPDIS5           (0x0020u)  /* LCD charge pump disable */
#define LCDCPDIS6           (0x0040u)  /* LCD charge pump disable */
#define LCDCPDIS7           (0x0080u)  /* LCD charge pump disable */
#define LCDCPCLKSYNC        (0x8000u)  /* LCD charge pump clock synchronization */

// LCDCCPCTL
#define LCDCPDIS0_L         (0x0001u)  /* LCD charge pump disable */
#define LCDCPDIS1_L         (0x0002u)  /* LCD charge pump disable */
#define LCDCPDIS2_L         (0x0004u)  /* LCD charge pump disable */
#define LCDCPDIS3_L         (0x0008u)  /* LCD charge pump disable */
#define LCDCPDIS4_L         (0x0010u)  /* LCD charge pump disable */
#define LCDCPDIS5_L         (0x0020u)  /* LCD charge pump disable */
#define LCDCPDIS6_L         (0x0040u)  /* LCD charge pump disable */
#define LCDCPDIS7_L         (0x0080u)  /* LCD charge pump disable */

// LCDCCPCTL
#define LCDCPCLKSYNC_H      (0x0080u)  /* LCD charge pump clock synchronization */

#define OFS_LCDM1             (0x0020u)  /* LCD Memory 1 */
#define LCDMEM_             LCDM1     /* LCD Memory */
#ifndef __IAR_SYSTEMS_ICC__
#define LCDMEM              LCDM1     /* LCD Memory (for assembler) */
#else
#define LCDMEM              ((char*) &LCDM1) /* LCD Memory (for C) */
#endif
#define OFS_LCDM2             (0x0021u)  /* LCD Memory 2 */
#define OFS_LCDM3             (0x0022u)  /* LCD Memory 3 */
#define OFS_LCDM4             (0x0023u)  /* LCD Memory 4 */
#define OFS_LCDM5             (0x0024u)  /* LCD Memory 5 */
#define OFS_LCDM6             (0x0025u)  /* LCD Memory 6 */
#define OFS_LCDM7             (0x0026u)  /* LCD Memory 7 */
#define OFS_LCDM8             (0x0027u)  /* LCD Memory 8 */
#define OFS_LCDM9             (0x0028u)  /* LCD Memory 9 */
#define OFS_LCDM10            (0x0029u)  /* LCD Memory 10 */
#define OFS_LCDM11            (0x002Au)  /* LCD Memory 11 */
#define OFS_LCDM12            (0x002Bu)  /* LCD Memory 12 */
#define OFS_LCDM13            (0x002Cu)  /* LCD Memory 13 */
#define OFS_LCDM14            (0x002Du)  /* LCD Memory 14 */
#define OFS_LCDM15            (0x002Eu)  /* LCD Memory 15 */
#define OFS_LCDM16            (0x002Fu)  /* LCD Memory 16 */
#define OFS_LCDM17            (0x0030u)  /* LCD Memory 17 */
#define OFS_LCDM18            (0x0031u)  /* LCD Memory 18 */
#define OFS_LCDM19            (0x0032u)  /* LCD Memory 19 */
#define OFS_LCDM20            (0x0033u)  /* LCD Memory 20 */
#define OFS_LCDM21            (0x0034u)  /* LCD Memory 21 */
#define OFS_LCDM22            (0x0035u)  /* LCD Memory 22 */
#define OFS_LCDM23            (0x0036u)  /* LCD Memory 23 */
#define OFS_LCDM24            (0x0037u)  /* LCD Memory 24 */
#define OFS_LCDM25            (0x0038u)  /* LCD Memory 25 */
#define OFS_LCDM26            (0x0039u)  /* LCD Memory 26 */
#define OFS_LCDM27            (0x003Au)  /* LCD Memory 27 */
#define OFS_LCDM28            (0x003Bu)  /* LCD Memory 28 */
#define OFS_LCDM29            (0x003Cu)  /* LCD Memory 29 */
#define OFS_LCDM30            (0x003Du)  /* LCD Memory 30 */
#define OFS_LCDM31            (0x003Eu)  /* LCD Memory 31 */
#define OFS_LCDM32            (0x003Fu)  /* LCD Memory 32 */
#define OFS_LCDM33            (0x0040u)  /* LCD Memory 33 */
#define OFS_LCDM34            (0x0041u)  /* LCD Memory 34 */
#define OFS_LCDM35            (0x0042u)  /* LCD Memory 35 */
#define OFS_LCDM36            (0x0043u)  /* LCD Memory 36 */
#define OFS_LCDM37            (0x0044u)  /* LCD Memory 37 */
#define OFS_LCDM38            (0x0045u)  /* LCD Memory 38 */
#define OFS_LCDM39            (0x0046u)  /* LCD Memory 39 */
#define OFS_LCDM40            (0x0047u)  /* LCD Memory 40 */

#define OFS_LCDBM1            (0x0040u)  /* LCD Blinking Memory 1 */
#define LCDBMEM_            LCDBM1    /* LCD Blinking Memory */
#ifndef __IAR_SYSTEMS_ICC__
#define LCDBMEM             (LCDBM1)  /* LCD Blinking Memory (for assembler) */
#else
#define LCDBMEM             ((char*) &LCDBM1) /* LCD Blinking Memory (for C) */
#endif
#define OFS_LCDBM2            (0x0041u)  /* LCD Blinking Memory 2 */
#define OFS_LCDBM3            (0x0042u)  /* LCD Blinking Memory 3 */
#define OFS_LCDBM4            (0x0043u)  /* LCD Blinking Memory 4 */
#define OFS_LCDBM5            (0x0044u)  /* LCD Blinking Memory 5 */
#define OFS_LCDBM6            (0x0045u)  /* LCD Blinking Memory 6 */
#define OFS_LCDBM7            (0x0046u)  /* LCD Blinking Memory 7 */
#define OFS_LCDBM8            (0x0047u)  /* LCD Blinking Memory 8 */
#define OFS_LCDBM9            (0x0048u)  /* LCD Blinking Memory 9 */
#define OFS_LCDBM10           (0x0049u)  /* LCD Blinking Memory 10 */
#define OFS_LCDBM11           (0x004Au)  /* LCD Blinking Memory 11 */
#define OFS_LCDBM12           (0x004Bu)  /* LCD Blinking Memory 12 */
#define OFS_LCDBM13           (0x004Cu)  /* LCD Blinking Memory 13 */
#define OFS_LCDBM14           (0x004Du)  /* LCD Blinking Memory 14 */
#define OFS_LCDBM15           (0x004Eu)  /* LCD Blinking Memory 15 */
#define OFS_LCDBM16           (0x004Fu)  /* LCD Blinking Memory 16 */
#define OFS_LCDBM17           (0x0050u)  /* LCD Blinking Memory 17 */
#define OFS_LCDBM18           (0x0051u)  /* LCD Blinking Memory 18 */
#define OFS_LCDBM19           (0x0052u)  /* LCD Blinking Memory 19 */
#define OFS_LCDBM20           (0x0053u)  /* LCD Blinking Memory 20 */

/* LCDCIV Definitions */
#define LCDCIV_NONE         (0x0000u)    /* No Interrupt pending */
#define LCDCIV_LCDNOCAPIFG  (0x0002u)    /* No capacitor connected */
#define LCDCIV_LCDCLKOFFIFG (0x0004u)    /* Blink, segments off */
#define LCDCIV_LCDCLKONIFG  (0x0006u)    /* Blink, segments on */
#define LCDCIV_LCDFRMIFG    (0x0008u)    /* Frame interrupt */

#endif
/************************************************************
* Memory Protection Unit
************************************************************/
#ifdef  __MSP430_HAS_MPU__             /* Definition to show that Module is available */

#define OFS_MPUCTL0           (0x0000u)  /* MPU Control Register 0 */
#define OFS_MPUCTL0_L          OFS_MPUCTL0
#define OFS_MPUCTL0_H          OFS_MPUCTL0+1
#define OFS_MPUCTL1           (0x0002u)  /* MPU Control Register 1 */
#define OFS_MPUCTL1_L          OFS_MPUCTL1
#define OFS_MPUCTL1_H          OFS_MPUCTL1+1
#define OFS_MPUSEGB2          (0x0004u)  /* MPU Segmentation Border 2 Register */
#define OFS_MPUSEGB2_L         OFS_MPUSEGB2
#define OFS_MPUSEGB2_H         OFS_MPUSEGB2+1
#define OFS_MPUSEGB1          (0x0006u)  /* MPU Segmentation Border 1 Register */
#define OFS_MPUSEGB1_L         OFS_MPUSEGB1
#define OFS_MPUSEGB1_H         OFS_MPUSEGB1+1
#define OFS_MPUSAM            (0x0008u)  /* MPU Access Management Register */
#define OFS_MPUSAM_L           OFS_MPUSAM
#define OFS_MPUSAM_H           OFS_MPUSAM+1
#define OFS_MPUIPC0           (0x000Au)  /* MPU IP Control 0 Register */
#define OFS_MPUIPC0_L          OFS_MPUIPC0
#define OFS_MPUIPC0_H          OFS_MPUIPC0+1
#define OFS_MPUIPSEGB2        (0x000Cu)  /* MPU IP Segment Border 2 Register */
#define OFS_MPUIPSEGB2_L       OFS_MPUIPSEGB2
#define OFS_MPUIPSEGB2_H       OFS_MPUIPSEGB2+1
#define OFS_MPUIPSEGB1        (0x000Eu)  /* MPU IP Segment Border 1 Register */
#define OFS_MPUIPSEGB1_L       OFS_MPUIPSEGB1
#define OFS_MPUIPSEGB1_H       OFS_MPUIPSEGB1+1

/* MPUCTL0 Control Bits */
#define MPUENA               (0x0001u)  /* MPU Enable */
#define MPULOCK              (0x0002u)  /* MPU Lock */
#define MPUSEGIE             (0x0010u)  /* MPU Enable NMI on Segment violation */

/* MPUCTL0 Control Bits */
#define MPUENA_L            (0x0001u)  /* MPU Enable */
#define MPULOCK_L           (0x0002u)  /* MPU Lock */
#define MPUSEGIE_L          (0x0010u)  /* MPU Enable NMI on Segment violation */

